//************************************************************
// Desciption: RDCv3 Register File Header File
//      Generated by genRF (Version 1.2) 07/20/2018 17:21:52
//************************************************************

#ifndef RDCV3_RF_H
#define RDCV3_RF_H

// Register 0x00
typedef union rdcv3_r00{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
    unsigned MBC_IGNORE_RX_FAIL		: 1;
    unsigned MBC_WAKEUP_ON_PEND_REQ		: 1;
    unsigned WAKEUP_UPON_RDC_IRQ		: 1;
  };
  uint32_t as_int;
} rdcv3_r00_t;
#define RDCv3_R00_DEFAULT {{0x1, 0x2, 0x1, 0x0, 0x0}}
_Static_assert(sizeof(rdcv3_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union rdcv3_r01{
  struct{
    unsigned IRQ_RPLY_REG_ADDR		: 8;
    unsigned IRQ_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} rdcv3_r01_t;
#define RDCv3_R01_DEFAULT {{0x07, 0x10}}
_Static_assert(sizeof(rdcv3_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union rdcv3_r02{
  struct{
    unsigned IRQ_RPLY_PYLD_LENGTH_1		: 8;
    unsigned IRQ_RPLY_PYLD_REG_ADDR		: 8;
  };
  uint32_t as_int;
} rdcv3_r02_t;
#define RDCv3_R02_DEFAULT {{0x00, 0x11}}
_Static_assert(sizeof(rdcv3_r02_t) == 4, "Punned Structure Size");

// Register 0x03
// -- EMPTY --

// Register 0x04
// -- EMPTY --

// Register 0x05
// -- EMPTY --

// Register 0x06
// -- EMPTY --

// Register 0x07
// -- EMPTY --

// Register 0x08
// -- EMPTY --

// Register 0x09
// -- EMPTY --

// Register 0x0A
// -- EMPTY --

// Register 0x0B
// -- EMPTY --

// Register 0x0C
// -- EMPTY --

// Register 0x0D
// -- EMPTY --

// Register 0x0E
// -- EMPTY --

// Register 0x0F
// -- EMPTY --

// Register 0x10
typedef union rdcv3_r10{
  struct{
    unsigned RDC_SIGNATURE		: 24;
  };
  uint32_t as_int;
} rdcv3_r10_t;
#define RDCv3_R10_DEFAULT {{0x022003}}
_Static_assert(sizeof(rdcv3_r10_t) == 4, "Punned Structure Size");

// Register 0x11
// -- READ-ONLY --

// Register 0x12
// -- EMPTY --

// Register 0x13
// -- EMPTY --

// Register 0x14
// -- EMPTY --

// Register 0x15
// -- EMPTY --

// Register 0x16
// -- EMPTY --

// Register 0x17
// -- EMPTY --

// Register 0x18
// -- EMPTY --

// Register 0x19
// -- EMPTY --

// Register 0x1A
// -- EMPTY --

// Register 0x1B
// -- EMPTY --

// Register 0x1C
// -- EMPTY --

// Register 0x1D
// -- EMPTY --

// Register 0x1E
// -- EMPTY --

// Register 0x1F
// -- EMPTY --

// Register 0x20
typedef union rdcv3_r20{
  struct{
    unsigned RDC_EN_AZ		: 1;
    unsigned RDC_CNT_AMP1		: 5;
    unsigned RDC_CNT_INIT		: 9;
    unsigned RDC_RESETn_FSM		: 1;
    unsigned NOT_DEFINED_32_16		: 1;
    unsigned RDC_ISOLATE		: 1;
  };
  uint32_t as_int;
} rdcv3_r20_t;
#define RDCv3_R20_DEFAULT {{0x1, 0x0C, 0x050, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(rdcv3_r20_t) == 4, "Punned Structure Size");

// Register 0x21
typedef union rdcv3_r21{
  struct{
    unsigned RDC_CNT_AMP2		: 5;
    unsigned RDC_CNT_REDIS		: 5;
    unsigned RDC_CNT_STORE		: 5;
    unsigned RDC_CNT_AZ_RESETB		: 4;
  };
  uint32_t as_int;
} rdcv3_r21_t;
#define RDCv3_R21_DEFAULT {{0x06, 0x08, 0x04, 0x2}}
_Static_assert(sizeof(rdcv3_r21_t) == 4, "Punned Structure Size");

// Register 0x22
typedef union rdcv3_r22{
  struct{
    unsigned RDC_OSR		: 7;
    unsigned RDC_CNT_SKIP		: 2;
    unsigned RDC_CNT_IDLE		: 4;
  };
  uint32_t as_int;
} rdcv3_r22_t;
#define RDCv3_R22_DEFAULT {{0x08, 0x1, 0x2}}
_Static_assert(sizeof(rdcv3_r22_t) == 4, "Punned Structure Size");

// Register 0x23
typedef union rdcv3_r23{
  struct{
    unsigned RDC_I_VCM_GEN_n_LC		: 2;
    unsigned RDC_VCM_R_SEL_LC		: 6;
    unsigned RDC_VREF_I_AMP_LC		: 5;
  };
  uint32_t as_int;
} rdcv3_r23_t;
#define RDCv3_R23_DEFAULT {{0x2, 0x2D, 0x00}}
_Static_assert(sizeof(rdcv3_r23_t) == 4, "Punned Structure Size");

// Register 0x24
typedef union rdcv3_r24{
  struct{
    unsigned RDC_SEL_GAIN_LC		: 5;
    unsigned RDC_SEL_VB3b_LC		: 3;
    unsigned RDC_SEL_VB2_LC		: 5;
    unsigned RDC_SEL_STORE		: 1;
    unsigned RDC_SEL_DLY		: 4;
  };
  uint32_t as_int;
} rdcv3_r24_t;
#define RDCv3_R24_DEFAULT {{0x16, 0x3, 0x04, 0x1, 0x5}}
_Static_assert(sizeof(rdcv3_r24_t) == 4, "Punned Structure Size");

// Register 0x25
typedef union rdcv3_r25{
  struct{
    unsigned RDC_I_AMP_BIASGEN		: 3;
    unsigned RDC_OFFSET_PB_LC		: 5;
    unsigned RDC_OFFSET_P_LC		: 5;
  };
  uint32_t as_int;
} rdcv3_r25_t;
#define RDCv3_R25_DEFAULT {{0x3, 0x09, 0x16}}
_Static_assert(sizeof(rdcv3_r25_t) == 4, "Punned Structure Size");

// Register 0x26
typedef union rdcv3_r26{
  struct{
    unsigned RDC_ENb_DWA		: 1;
    unsigned RDC_SEL_ADC_MODE		: 1;
    unsigned RDC_OFFSET_SELP_B_LC		: 3;
    unsigned RDC_OFFSET_SELN_B_LC		: 3;
  };
  uint32_t as_int;
} rdcv3_r26_t;
#define RDCv3_R26_DEFAULT {{0x0, 0x0, 0x7, 0x7}}
_Static_assert(sizeof(rdcv3_r26_t) == 4, "Punned Structure Size");

// Register 0x27
typedef union rdcv3_r27{
  struct{
    unsigned RDC_I_BUF_VH_n_LC		: 3;
  };
  uint32_t as_int;
} rdcv3_r27_t;
#define RDCv3_R27_DEFAULT {{0x5}}
_Static_assert(sizeof(rdcv3_r27_t) == 4, "Punned Structure Size");

// Register 0x28
typedef union rdcv3_r28{
  struct{
    unsigned RDC_I_MIRROR		: 2;
    unsigned RDC_I_CMP		: 4;
    unsigned RDC_I_BUF2		: 4;
    unsigned RDC_I_BUF		: 4;
    unsigned RDC_R_REF		: 4;
    unsigned RDC_RESET_RC_OSC		: 1;
  };
  uint32_t as_int;
} rdcv3_r28_t;
#define RDCv3_R28_DEFAULT {{0x1, 0x1, 0x0, 0x0, 0x8, 0x1}}
_Static_assert(sizeof(rdcv3_r28_t) == 4, "Punned Structure Size");

// Register 0x29
typedef union rdcv3_r29{
  struct{
    unsigned RDC_PDIFF		: 15;
  };
  uint32_t as_int;
} rdcv3_r29_t;
#define RDCv3_R29_DEFAULT {{0x0200}}
_Static_assert(sizeof(rdcv3_r29_t) == 4, "Punned Structure Size");

// Register 0x2A
typedef union rdcv3_r2A{
  struct{
    unsigned RDC_POLY		: 24;
  };
  uint32_t as_int;
} rdcv3_r2A_t;
#define RDCv3_R2A_DEFAULT {{0x004000}}
_Static_assert(sizeof(rdcv3_r2A_t) == 4, "Punned Structure Size");

// Register 0x2B
typedef union rdcv3_r2B{
  struct{
    unsigned RDC_CLK_ISOLATE		: 1;
    unsigned RDC_MOM		: 3;
    unsigned RDC_MIM		: 3;
  };
  uint32_t as_int;
} rdcv3_r2B_t;
#define RDCv3_R2B_DEFAULT {{0x1, 0x4, 0x4}}
_Static_assert(sizeof(rdcv3_r2B_t) == 4, "Punned Structure Size");

// Register 0x2C
typedef union rdcv3_r2C{
  struct{
    unsigned RDC_ENb_PG_BUF_VH_VBAT		: 1;
    unsigned RDC_ENb_PG_BUF_VCM		: 1;
    unsigned RDC_ENb_MIRROR_LDO		: 1;
    unsigned RDC_ENb_PG_ADC_VBAT		: 1;
    unsigned RDC_ENb_PG_AMP_VBAT		: 1;
    unsigned RDC_ENb_PG_VREF		: 1;
    unsigned RDC_EN_PG_RC_OSC		: 1;
    unsigned RDC_EN_PG_BUF_VH_V1P2		: 1;
    unsigned RDC_EN_PG_ADC_V1P2		: 1;
    unsigned RDC_EN_PG_AMP_V1P2		: 1;
    unsigned RDC_EN_PG_FSM		: 1;
  };
  uint32_t as_int;
} rdcv3_r2C_t;
#define RDCv3_R2C_DEFAULT {{0x0, 0x0, 0x1, 0x0, 0x0, 0x0, 0x1, 0x1, 0x1, 0x1, 0x1}}
_Static_assert(sizeof(rdcv3_r2C_t) == 4, "Punned Structure Size");

#endif // RDCV3_RF_H