//************************************************************
// Desciption: MRMv1S Register File Header File
//      Generated by genRF (Version 1.60) 05/01/2024 02:50:35
//************************************************************

#ifndef MRMV1S_RF_H
#define MRMV1S_RF_H

// Register 0x00
typedef union mrmv1s_r00{
  struct{
    unsigned Tcyc_read		: 16;
  };
  uint32_t as_int;
} mrmv1s_r00_t;
#define MRMv1S_R00_DEFAULT {{0x0000}}
#define MRMv1S_R00_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union mrmv1s_r01{
  struct{
    unsigned Tcyc_prog_s		: 16;
  };
  uint32_t as_int;
} mrmv1s_r01_t;
#define MRMv1S_R01_DEFAULT {{0x0000}}
#define MRMv1S_R01_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union mrmv1s_r02{
  struct{
    unsigned Tcyc_prog_f		: 16;
  };
  uint32_t as_int;
} mrmv1s_r02_t;
#define MRMv1S_R02_DEFAULT {{0x0000}}
#define MRMv1S_R02_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r02_t) == 4, "Punned Structure Size");

// Register 0x03
typedef union mrmv1s_r03{
  struct{
    unsigned T100ns		: 8;
    unsigned Tpwr		: 16;
  };
  uint32_t as_int;
} mrmv1s_r03_t;
#define MRMv1S_R03_DEFAULT {{0x00, 0x00C8}}
#define MRMv1S_R03_DEFAULT_AS_INT 0x00C800
_Static_assert(sizeof(mrmv1s_r03_t) == 4, "Punned Structure Size");

// Register 0x04
// -- EMPTY --

// Register 0x05
// -- EMPTY --

// Register 0x06
typedef union mrmv1s_r06{
  struct{
    unsigned MBC_EXPERIMENTAL		: 1;
  };
  uint32_t as_int;
} mrmv1s_r06_t;
#define MRMv1S_R06_DEFAULT {{0x0}}
#define MRMv1S_R06_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r06_t) == 4, "Punned Structure Size");

// Register 0x07
typedef union mrmv1s_r07{
  struct{
    unsigned SRAM_START_ADDR		: 14;
  };
  uint32_t as_int;
} mrmv1s_r07_t;
#define MRMv1S_R07_DEFAULT {{0x0000}}
#define MRMv1S_R07_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r07_t) == 4, "Punned Structure Size");

// Register 0x08
typedef union mrmv1s_r08{
  struct{
    unsigned MRAM_START_ADDR		: 20;
  };
  uint32_t as_int;
} mrmv1s_r08_t;
#define MRMv1S_R08_DEFAULT {{0x00000}}
#define MRMv1S_R08_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r08_t) == 4, "Punned Structure Size");

// Register 0x09
typedef union mrmv1s_r09{
  struct{
    unsigned GO		: 1;
    unsigned CMD		: 4;
    unsigned IRQ_EN		: 1;
    unsigned LENGTH		: 14;
  };
  uint32_t as_int;
} mrmv1s_r09_t;
#define MRMv1S_R09_DEFAULT {{0x0, 0x0, 0x0, 0x0000}}
#define MRMv1S_R09_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r09_t) == 4, "Punned Structure Size");

// Register 0x0A
// -- EMPTY --

// Register 0x0B
// -- EMPTY --

// Register 0x0C
typedef union mrmv1s_r0C{
  struct{
    unsigned BIT_EN_EXT		: 2;
    unsigned UPDATE_ADDR_EXT		: 1;
    unsigned WRAP_EXT		: 1;
  };
  uint32_t as_int;
} mrmv1s_r0C_t;
#define MRMv1S_R0C_DEFAULT {{0x1, 0x0, 0x0}}
#define MRMv1S_R0C_DEFAULT_AS_INT 0x000001
_Static_assert(sizeof(mrmv1s_r0C_t) == 4, "Punned Structure Size");

// Register 0x0D
typedef union mrmv1s_r0D{
  struct{
    unsigned TIMEOUT_EXT		: 24;
  };
  uint32_t as_int;
} mrmv1s_r0D_t;
#define MRMv1S_R0D_DEFAULT {{0xFFFFFF}}
#define MRMv1S_R0D_DEFAULT_AS_INT 0xFFFFFF
_Static_assert(sizeof(mrmv1s_r0D_t) == 4, "Punned Structure Size");

// Register 0x0E
typedef union mrmv1s_r0E{
  struct{
    unsigned SRAM_START_ADDR_EXT		: 14;
  };
  uint32_t as_int;
} mrmv1s_r0E_t;
#define MRMv1S_R0E_DEFAULT {{0x0000}}
#define MRMv1S_R0E_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r0E_t) == 4, "Punned Structure Size");

// Register 0x0F
typedef union mrmv1s_r0F{
  struct{
    unsigned INT_RPLY_REG_ADDR		: 8;
    unsigned INT_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} mrmv1s_r0F_t;
#define MRMv1S_R0F_DEFAULT {{0x00, 0x10}}
#define MRMv1S_R0F_DEFAULT_AS_INT 0x001000
_Static_assert(sizeof(mrmv1s_r0F_t) == 4, "Punned Structure Size");

// Register 0x10
typedef union mrmv1s_r10{
  struct{
    unsigned BOOT_REG_PATTERN		: 2;
    unsigned NOT_DEFINED_16_2		: 1;
    unsigned NOT_DEFINED_16_3		: 1;
    unsigned NOT_DEFINED_16_4		: 1;
    unsigned NOT_DEFINED_16_5		: 1;
    unsigned NOT_DEFINED_16_6		: 1;
    unsigned NOT_DEFINED_16_7		: 1;
    unsigned NOT_DEFINED_16_8		: 1;
    unsigned NOT_DEFINED_16_9		: 1;
    unsigned NOT_DEFINED_16_10		: 1;
    unsigned NOT_DEFINED_16_11		: 1;
    unsigned NOT_DEFINED_16_12		: 1;
    unsigned NOT_DEFINED_16_13		: 1;
    unsigned NOT_DEFINED_16_14		: 1;
    unsigned NOT_DEFINED_16_15		: 1;
    unsigned BOOT_FLAG_SUCCESS		: 1;
    unsigned BOOT_FLAG_CHKSUM_ERROR		: 1;
    unsigned BOOT_FLAG_INVALID_CMND		: 1;
    unsigned BOOT_FLAG_PWDN		: 1;
    unsigned BOOT_FLAG_WRONG_HEADER		: 1;
    unsigned BOOT_FLAG_ECC_ERROR		: 1;
    unsigned BOOT_FLAG_SLEEP		: 1;
  };
  uint32_t as_int;
} mrmv1s_r10_t;
#define MRMv1S_R10_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
#define MRMv1S_R10_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r10_t) == 4, "Punned Structure Size");

// Register 0x11
typedef union mrmv1s_r11{
  struct{
    unsigned MRAM_PWR_GO		: 1;
    unsigned MRAM_PWR_SEL_ON		: 1;
    unsigned MRAM_PWR_IRQ_EN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r11_t;
#define MRMv1S_R11_DEFAULT {{0x0, 0x1, 0x1}}
#define MRMv1S_R11_DEFAULT_AS_INT 0x000006
_Static_assert(sizeof(mrmv1s_r11_t) == 4, "Punned Structure Size");

// Register 0x12
typedef union mrmv1s_r12{
  struct{
    unsigned MRAM_PWR_AUTO_ON		: 1;
    unsigned MRAM_PWR_AUTO_OFF		: 1;
  };
  uint32_t as_int;
} mrmv1s_r12_t;
#define MRMv1S_R12_DEFAULT {{0x0, 0x0}}
#define MRMv1S_R12_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r12_t) == 4, "Punned Structure Size");

// Register 0x13
typedef union mrmv1s_r13{
  struct{
    unsigned PP_STR_EN		: 1;
    unsigned PP_STR_LIMIT		: 21;
  };
  uint32_t as_int;
} mrmv1s_r13_t;
#define MRMv1S_R13_DEFAULT {{0x0, 0x000000}}
#define MRMv1S_R13_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r13_t) == 4, "Punned Structure Size");

// Register 0x14
typedef union mrmv1s_r14{
  struct{
    unsigned PP_BIT_EN_EXT		: 2;
    unsigned PP_WRAP		: 1;
    unsigned NOT_DEFINED_20_3		: 1;
    unsigned PP_NO_ERR_DETECTION		: 1;
    unsigned PP_EARLY_POWER_ON		: 1;
  };
  uint32_t as_int;
} mrmv1s_r14_t;
#define MRMv1S_R14_DEFAULT {{0x1, 0x0, 0x0, 0x0, 0x1}}
#define MRMv1S_R14_DEFAULT_AS_INT 0x000021
_Static_assert(sizeof(mrmv1s_r14_t) == 4, "Punned Structure Size");

// Register 0x15
typedef union mrmv1s_r15{
  struct{
    unsigned PP_MRAM_ADDR		: 20;
    unsigned NOT_DEFINED_21_20		: 1;
    unsigned NOT_DEFINED_21_21		: 1;
    unsigned NOT_DEFINED_21_22		: 1;
    unsigned PP_FLAG_END_OF_MRAM		: 1;
  };
  uint32_t as_int;
} mrmv1s_r15_t;
#define MRMv1S_R15_DEFAULT {{0x00000, 0x0, 0x0, 0x0, 0x0}}
#define MRMv1S_R15_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r15_t) == 4, "Punned Structure Size");

// Register 0x16
typedef union mrmv1s_r16{
  struct{
    unsigned PP_LENGTH_STREAMED		: 21;
    unsigned NOT_DEFINED_22_21		: 1;
    unsigned NOT_DEFINED_22_22		: 1;
    unsigned PP_FLAG_STR_LIMIT		: 1;
  };
  uint32_t as_int;
} mrmv1s_r16_t;
#define MRMv1S_R16_DEFAULT {{0x000000, 0x0, 0x0, 0x0}}
#define MRMv1S_R16_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r16_t) == 4, "Punned Structure Size");

// Register 0x17
typedef union mrmv1s_r17{
  struct{
    unsigned PP_LENGTH_COPIED		: 21;
    unsigned NOT_DEFINED_23_21		: 1;
    unsigned NOT_DEFINED_23_22		: 1;
    unsigned PP_FLAG_COPY_LIMIT		: 1;
  };
  uint32_t as_int;
} mrmv1s_r17_t;
#define MRMv1S_R17_DEFAULT {{0x000000, 0x0, 0x0, 0x0}}
#define MRMv1S_R17_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r17_t) == 4, "Punned Structure Size");

// Register 0x18
// -- EMPTY --

// Register 0x19
// -- EMPTY --

// Register 0x1A
// -- EMPTY --

// Register 0x1B
// -- READ-ONLY --

// Register 0x1C
// -- EMPTY --

// Register 0x1D
// -- EMPTY --

// Register 0x1E
// -- READ-ONLY --

// Register 0x1F
typedef union mrmv1s_r1F{
  struct{
    unsigned FORCE_RESETN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r1F_t;
#define MRMv1S_R1F_DEFAULT {{0x1}}
#define MRMv1S_R1F_DEFAULT_AS_INT 0x000001
_Static_assert(sizeof(mrmv1s_r1F_t) == 4, "Punned Structure Size");

// Register 0x20
typedef union mrmv1s_r20{
  struct{
    unsigned MEM_ISOLATE_B		: 1;
    unsigned MEM_CLK_EN		: 1;
    unsigned MEM_RESET_B		: 1;
  };
  uint32_t as_int;
} mrmv1s_r20_t;
#define MRMv1S_R20_DEFAULT {{0x0, 0x0, 0x0}}
#define MRMv1S_R20_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r20_t) == 4, "Punned Structure Size");

// Register 0x21
typedef union mrmv1s_r21{
  struct{
    unsigned LDO_PWR_GO		: 1;
    unsigned LDO_PWR_SEL_ON		: 1;
    unsigned LDO_PWR_IRQ_EN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r21_t;
#define MRMv1S_R21_DEFAULT {{0x0, 0x1, 0x1}}
#define MRMv1S_R21_DEFAULT_AS_INT 0x000006
_Static_assert(sizeof(mrmv1s_r21_t) == 4, "Punned Structure Size");

// Register 0x22
typedef union mrmv1s_r22{
  struct{
    unsigned LDO_ISOL_LC		: 1;
    unsigned LDO_VREF_ENb		: 1;
    unsigned LDO_EN_LDO_BUF		: 1;
    unsigned LDO_EN_LDO_1P8		: 1;
    unsigned LDO_EN_LDO_0P8		: 1;
    unsigned LDO_EN_DCP_1P8		: 1;
    unsigned LDO_EN_DCP_0P8		: 1;
  };
  uint32_t as_int;
} mrmv1s_r22_t;
#define MRMv1S_R22_DEFAULT {{0x1, 0x1, 0x0, 0x0, 0x0, 0x0, 0x0}}
#define MRMv1S_R22_DEFAULT_AS_INT 0x000003
_Static_assert(sizeof(mrmv1s_r22_t) == 4, "Punned Structure Size");

// Register 0x23
typedef union mrmv1s_r23{
  struct{
    unsigned LDO_SEL_IBIAS_LDO_BUF		: 2;
    unsigned LDO_SEL_IBIAS_LDO_1P8		: 2;
    unsigned LDO_SEL_IBIAS_LDO_0P8		: 2;
    unsigned LDO_SELB_VOUT_LDO_BUF		: 4;
    unsigned LDO_SELB_VOUT_LDO_1P8		: 4;
    unsigned LDO_SELB_I_CTRL_LDO_1P8		: 5;
    unsigned LDO_SELB_I_CTRL_LDO_0P8		: 5;
  };
  uint32_t as_int;
} mrmv1s_r23_t;
#define MRMv1S_R23_DEFAULT {{0x1, 0x1, 0x1, 0x4, 0x7, 0x01, 0x01}}
#define MRMv1S_R23_DEFAULT_AS_INT 0x085D15
_Static_assert(sizeof(mrmv1s_r23_t) == 4, "Punned Structure Size");

// Register 0x24
typedef union mrmv1s_r24{
  struct{
    unsigned LDO_VREF_SEL_R		: 3;
    unsigned LDO_T25		: 5;
  };
  uint32_t as_int;
} mrmv1s_r24_t;
#define MRMv1S_R24_DEFAULT {{0x4, 0x05}}
#define MRMv1S_R24_DEFAULT_AS_INT 0x00002C
_Static_assert(sizeof(mrmv1s_r24_t) == 4, "Punned Structure Size");

// Register 0x25
typedef union mrmv1s_r25{
  struct{
    unsigned LDO_TDECAP		: 16;
    unsigned LDO_T100		: 8;
  };
  uint32_t as_int;
} mrmv1s_r25_t;
#define MRMv1S_R25_DEFAULT {{0x1388, 0x14}}
#define MRMv1S_R25_DEFAULT_AS_INT 0x141388
_Static_assert(sizeof(mrmv1s_r25_t) == 4, "Punned Structure Size");

// Register 0x26
typedef union mrmv1s_r26{
  struct{
    unsigned CLK_GEN_S		: 7;
  };
  uint32_t as_int;
} mrmv1s_r26_t;
#define MRMv1S_R26_DEFAULT {{0x57}}
#define MRMv1S_R26_DEFAULT_AS_INT 0x000057
_Static_assert(sizeof(mrmv1s_r26_t) == 4, "Punned Structure Size");

// Register 0x27
typedef union mrmv1s_r27{
  struct{
    unsigned SRAM_RAWLM		: 2;
    unsigned SRAM_RAWL		: 1;
    unsigned SRAM_WABLM		: 3;
    unsigned SRAM_WABL		: 1;
    unsigned SRAM_EMAS		: 1;
    unsigned SRAM_EMAW		: 2;
    unsigned SRAM_EMA		: 3;
    unsigned SRAM_STOV		: 1;
    unsigned SRAM_USE_Q_LAT		: 1;
  };
  uint32_t as_int;
} mrmv1s_r27_t;
#define MRMv1S_R27_DEFAULT {{0x1, 0x1, 0x2, 0x1, 0x0, 0x1, 0x2, 0x0, 0x0}}
#define MRMv1S_R27_DEFAULT_AS_INT 0x000955
_Static_assert(sizeof(mrmv1s_r27_t) == 4, "Punned Structure Size");

// Register 0x28
typedef union mrmv1s_r28{
  struct{
    unsigned EN_PD_C_EXT		: 1;
    unsigned EN_PD_D_EXT		: 2;
    unsigned NOT_DEFINED_40_3		: 1;
    unsigned EN_PD_TCK		: 1;
    unsigned EN_PD_TMS		: 1;
    unsigned EN_PD_TDI		: 1;
  };
  uint32_t as_int;
} mrmv1s_r28_t;
#define MRMv1S_R28_DEFAULT {{0x1, 0x3, 0x0, 0x1, 0x1, 0x1}}
#define MRMv1S_R28_DEFAULT_AS_INT 0x000077
_Static_assert(sizeof(mrmv1s_r28_t) == 4, "Punned Structure Size");

// Register 0x29
typedef union mrmv1s_r29{
  struct{
    unsigned BIST_ENABLE		: 1;
  };
  uint32_t as_int;
} mrmv1s_r29_t;
#define MRMv1S_R29_DEFAULT {{0x0}}
#define MRMv1S_R29_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r29_t) == 4, "Punned Structure Size");

// Register 0x2A
// -- READ-ONLY --

// Register 0x2B
typedef union mrmv1s_r2B{
  struct{
    unsigned TMC_R_CMD		: 5;
    unsigned TMC_R_LPR		: 1;
    unsigned TMC_R_SLP		: 1;
    unsigned TMC_R_INFO		: 1;
    unsigned TMC_R_IFREN1		: 1;
    unsigned TMC_R_SRAM_DMA		: 1;
    unsigned TMC_R_CFG_VBL_EXT_VMAX		: 1;
    unsigned TMC_R_CFG_2CPB		: 1;
  };
  uint32_t as_int;
} mrmv1s_r2B_t;
#define MRMv1S_R2B_DEFAULT {{0x00, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
#define MRMv1S_R2B_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r2B_t) == 4, "Punned Structure Size");

// Register 0x2C
typedef union mrmv1s_r2C{
  struct{
    unsigned TMC_SCAN_TEST		: 1;
    unsigned TMC_SCAN_RST_N		: 1;
  };
  uint32_t as_int;
} mrmv1s_r2C_t;
#define MRMv1S_R2C_DEFAULT {{0x0, 0x0}}
#define MRMv1S_R2C_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r2C_t) == 4, "Punned Structure Size");

// Register 0x2D
// -- EMPTY --

// Register 0x2E
typedef union mrmv1s_r2E{
  struct{
    // unsigned TDO		: 1; // READ-ONLY
    unsigned TDI		: 1;
    unsigned TMS		: 1;
    unsigned TCK		: 1;
    unsigned TDO_DLY		: 8;
    unsigned TCK_PW		: 8;
    unsigned TDO_IRQ		: 2;
    unsigned JTAG_MODE		: 2;
  };
  uint32_t as_int;
} mrmv1s_r2E_t;
#define MRMv1S_R2E_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x04, 0x00, 0x0, 0x0}}
#define MRMv1S_R2E_DEFAULT_AS_INT 0x000040
_Static_assert(sizeof(mrmv1s_r2E_t) == 4, "Punned Structure Size");

// Register 0x2F
typedef union mrmv1s_r2F{
  struct{
    unsigned TMC_DO_AWK		: 1;
    unsigned TMC_DO_REG_LOAD		: 1;
    unsigned TMC_FAST_LOAD		: 1;
    unsigned TMC_CHECK_ERR		: 1;
    unsigned TMC_CLOCK_MODE		: 1;
    unsigned TMC_RST_AUTO_WK		: 1;
  };
  uint32_t as_int;
} mrmv1s_r2F_t;
#define MRMv1S_R2F_DEFAULT {{0x0, 0x1, 0x1, 0x0, 0x0, 0x1}}
#define MRMv1S_R2F_DEFAULT_AS_INT 0x000026
_Static_assert(sizeof(mrmv1s_r2F_t) == 4, "Punned Structure Size");

// Register 0x30
typedef union mrmv1s_r30{
  struct{
    unsigned TWRS_S		: 8;
    unsigned TW2R_S		: 8;
    unsigned TPGM		: 8;
  };
  uint32_t as_int;
} mrmv1s_r30_t;
#define MRMv1S_R30_DEFAULT {{0x00, 0x00, 0x0B}}
#define MRMv1S_R30_DEFAULT_AS_INT 0x0B0000
_Static_assert(sizeof(mrmv1s_r30_t) == 4, "Punned Structure Size");

// Register 0x31
typedef union mrmv1s_r31{
  struct{
    unsigned TCYCRD1_S		: 4;
    unsigned TRDL_S		: 7;
  };
  uint32_t as_int;
} mrmv1s_r31_t;
#define MRMv1S_R31_DEFAULT {{0x0, 0x00}}
#define MRMv1S_R31_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r31_t) == 4, "Punned Structure Size");

// Register 0x32
typedef union mrmv1s_r32{
  struct{
    unsigned TCYCRD_S		: 4;
    unsigned TWK_S		: 8;
    unsigned TRDS_S		: 9;
  };
  uint32_t as_int;
} mrmv1s_r32_t;
#define MRMv1S_R32_DEFAULT {{0x0, 0x00, 0x000}}
#define MRMv1S_R32_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r32_t) == 4, "Punned Structure Size");

// Register 0x33
typedef union mrmv1s_r33{
  struct{
    unsigned TPGM_OTP_RP		: 6;
    unsigned TPGM_OTP_RAP		: 6;
    unsigned TPGM_OTP_RBD		: 7;
  };
  uint32_t as_int;
} mrmv1s_r33_t;
#define MRMv1S_R33_DEFAULT {{0x05, 0x05, 0x1D}}
#define MRMv1S_R33_DEFAULT_AS_INT 0x01D145
_Static_assert(sizeof(mrmv1s_r33_t) == 4, "Punned Structure Size");

// Register 0x34
typedef union mrmv1s_r34{
  struct{
    unsigned TWK_F		: 8;
    unsigned TWRS_F		: 8;
    unsigned TW2R_F		: 8;
  };
  uint32_t as_int;
} mrmv1s_r34_t;
#define MRMv1S_R34_DEFAULT {{0x86, 0x89, 0x32}}
#define MRMv1S_R34_DEFAULT_AS_INT 0x328986
_Static_assert(sizeof(mrmv1s_r34_t) == 4, "Punned Structure Size");

// Register 0x35
typedef union mrmv1s_r35{
  struct{
    unsigned TCYCRD_F		: 4;
    unsigned TCYCRD1_F		: 4;
    unsigned TRDS_F		: 9;
    unsigned TRDL_F		: 7;
  };
  uint32_t as_int;
} mrmv1s_r35_t;
#define MRMv1S_R35_DEFAULT {{0x0, 0x0, 0x005, 0x0A}}
#define MRMv1S_R35_DEFAULT_AS_INT 0x140500
_Static_assert(sizeof(mrmv1s_r35_t) == 4, "Punned Structure Size");

// Register 0x36
typedef union mrmv1s_r36{
  struct{
    unsigned TMC_R_4PHASE_WRITE0_1		: 8;
    unsigned TMC_R_4PHASE_WRITE0_2		: 8;
    unsigned TMC_R_4PHASE_WRITE0_3		: 8;
  };
  uint32_t as_int;
} mrmv1s_r36_t;
#define MRMv1S_R36_DEFAULT {{0x00, 0x00, 0x00}}
#define MRMv1S_R36_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r36_t) == 4, "Punned Structure Size");

// Register 0x37
typedef union mrmv1s_r37{
  struct{
    unsigned TMC_R_4PHASE_WRITE1_2		: 8;
    unsigned TMC_R_4PHASE_WRITE1_3		: 8;
    unsigned TMC_R_4PHASE_WRITE0_0		: 8;
  };
  uint32_t as_int;
} mrmv1s_r37_t;
#define MRMv1S_R37_DEFAULT {{0x00, 0x00, 0x00}}
#define MRMv1S_R37_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r37_t) == 4, "Punned Structure Size");

// Register 0x38
typedef union mrmv1s_r38{
  struct{
    unsigned TMC_R_4PHASE_MRG_0_3		: 8;
    unsigned TMC_R_4PHASE_WRITE1_0		: 8;
    unsigned TMC_R_4PHASE_WRITE1_1		: 8;
  };
  uint32_t as_int;
} mrmv1s_r38_t;
#define MRMv1S_R38_DEFAULT {{0x01, 0x00, 0x00}}
#define MRMv1S_R38_DEFAULT_AS_INT 0x000001
_Static_assert(sizeof(mrmv1s_r38_t) == 4, "Punned Structure Size");

// Register 0x39
typedef union mrmv1s_r39{
  struct{
    unsigned TMC_R_4PHASE_MRG_0_0		: 8;
    unsigned TMC_R_4PHASE_MRG_0_1		: 8;
    unsigned TMC_R_4PHASE_MRG_0_2		: 8;
  };
  uint32_t as_int;
} mrmv1s_r39_t;
#define MRMv1S_R39_DEFAULT {{0x2C, 0x01, 0x00}}
#define MRMv1S_R39_DEFAULT_AS_INT 0x00012C
_Static_assert(sizeof(mrmv1s_r39_t) == 4, "Punned Structure Size");

// Register 0x3A
typedef union mrmv1s_r3A{
  struct{
    unsigned TMC_R_4PHASE_MRG_1_1		: 8;
    unsigned TMC_R_4PHASE_MRG_1_2		: 8;
    unsigned TMC_R_4PHASE_MRG_1_3		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3A_t;
#define MRMv1S_R3A_DEFAULT {{0x00, 0xC0, 0x00}}
#define MRMv1S_R3A_DEFAULT_AS_INT 0x00C000
_Static_assert(sizeof(mrmv1s_r3A_t) == 4, "Punned Structure Size");

// Register 0x3B
typedef union mrmv1s_r3B{
  struct{
    unsigned TMC_R_CFG0_2		: 8;
    unsigned TMC_R_CFG0_3		: 8;
    unsigned TMC_R_4PHASE_MRG_1_0		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3B_t;
#define MRMv1S_R3B_DEFAULT {{0x54, 0xA0, 0x00}}
#define MRMv1S_R3B_DEFAULT_AS_INT 0x00A054
_Static_assert(sizeof(mrmv1s_r3B_t) == 4, "Punned Structure Size");

// Register 0x3C
typedef union mrmv1s_r3C{
  struct{
    unsigned TMC_R_CFG1_3		: 8;
    unsigned TMC_R_CFG0_0		: 8;
    unsigned TMC_R_CFG0_1		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3C_t;
#define MRMv1S_R3C_DEFAULT {{0x00, 0x08, 0x21}}
#define MRMv1S_R3C_DEFAULT_AS_INT 0x210800
_Static_assert(sizeof(mrmv1s_r3C_t) == 4, "Punned Structure Size");

// Register 0x3D
typedef union mrmv1s_r3D{
  struct{
    unsigned TMC_R_CFG1_0		: 8;
    unsigned TMC_R_CFG1_1		: 8;
    unsigned TMC_R_CFG1_2		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3D_t;
#define MRMv1S_R3D_DEFAULT {{0x2E, 0x1E, 0x2A}}
#define MRMv1S_R3D_DEFAULT_AS_INT 0x2A1E2E
_Static_assert(sizeof(mrmv1s_r3D_t) == 4, "Punned Structure Size");

// Register 0x3E
typedef union mrmv1s_r3E{
  struct{
    unsigned TMC_R_CFG5_1		: 8;
    unsigned TMC_R_CFG5_2		: 8;
    unsigned TMC_R_CFG5_3		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3E_t;
#define MRMv1S_R3E_DEFAULT {{0x8D, 0x00, 0x0C}}
#define MRMv1S_R3E_DEFAULT_AS_INT 0x0C008D
_Static_assert(sizeof(mrmv1s_r3E_t) == 4, "Punned Structure Size");

// Register 0x3F
typedef union mrmv1s_r3F{
  struct{
    unsigned NOT_DEFINED_63_0		: 1;
    unsigned NOT_DEFINED_63_1		: 1;
    unsigned NOT_DEFINED_63_2		: 1;
    unsigned NOT_DEFINED_63_3		: 1;
    unsigned NOT_DEFINED_63_4		: 1;
    unsigned NOT_DEFINED_63_5		: 1;
    unsigned NOT_DEFINED_63_6		: 1;
    unsigned NOT_DEFINED_63_7		: 1;
    unsigned NOT_DEFINED_63_8		: 1;
    unsigned NOT_DEFINED_63_9		: 1;
    unsigned NOT_DEFINED_63_10		: 1;
    unsigned NOT_DEFINED_63_11		: 1;
    unsigned NOT_DEFINED_63_12		: 1;
    unsigned NOT_DEFINED_63_13		: 1;
    unsigned NOT_DEFINED_63_14		: 1;
    unsigned NOT_DEFINED_63_15		: 1;
    unsigned TMC_R_CFG5_0		: 8;
  };
  uint32_t as_int;
} mrmv1s_r3F_t;
#define MRMv1S_R3F_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0xD3}}
#define MRMv1S_R3F_DEFAULT_AS_INT 0xD30000
_Static_assert(sizeof(mrmv1s_r3F_t) == 4, "Punned Structure Size");

// Register 0x40
typedef union mrmv1s_r40{
  struct{
    unsigned NOT_DEFINED_64_0		: 1;
    unsigned NOT_DEFINED_64_1		: 1;
    unsigned NOT_DEFINED_64_2		: 1;
    unsigned NOT_DEFINED_64_3		: 1;
    unsigned NOT_DEFINED_64_4		: 1;
    unsigned NOT_DEFINED_64_5		: 1;
    unsigned NOT_DEFINED_64_6		: 1;
    unsigned NOT_DEFINED_64_7		: 1;
    unsigned NOT_DEFINED_64_8		: 1;
    unsigned NOT_DEFINED_64_9		: 1;
    unsigned NOT_DEFINED_64_10		: 1;
    unsigned NOT_DEFINED_64_11		: 1;
    unsigned NOT_DEFINED_64_12		: 1;
    unsigned NOT_DEFINED_64_13		: 1;
    unsigned NOT_DEFINED_64_14		: 1;
    unsigned NOT_DEFINED_64_15		: 1;
    unsigned STR_WR_CH1_ALT_ADDR		: 8;
  };
  uint32_t as_int;
} mrmv1s_r40_t;
#define MRMv1S_R40_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0xF0}}
#define MRMv1S_R40_DEFAULT_AS_INT 0xF00000
_Static_assert(sizeof(mrmv1s_r40_t) == 4, "Punned Structure Size");

// Register 0x41
typedef union mrmv1s_r41{
  struct{
    unsigned NOT_DEFINED_65_0		: 1;
    unsigned NOT_DEFINED_65_1		: 1;
    unsigned NOT_DEFINED_65_2		: 1;
    unsigned NOT_DEFINED_65_3		: 1;
    unsigned NOT_DEFINED_65_4		: 1;
    unsigned NOT_DEFINED_65_5		: 1;
    unsigned NOT_DEFINED_65_6		: 1;
    unsigned NOT_DEFINED_65_7		: 1;
    unsigned NOT_DEFINED_65_8		: 1;
    unsigned NOT_DEFINED_65_9		: 1;
    unsigned NOT_DEFINED_65_10		: 1;
    unsigned NOT_DEFINED_65_11		: 1;
    unsigned NOT_DEFINED_65_12		: 1;
    unsigned NOT_DEFINED_65_13		: 1;
    unsigned NOT_DEFINED_65_14		: 1;
    unsigned NOT_DEFINED_65_15		: 1;
    unsigned STR_WR_CH1_ALT_REG_WR		: 8;
  };
  uint32_t as_int;
} mrmv1s_r41_t;
#define MRMv1S_R41_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x00}}
#define MRMv1S_R41_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r41_t) == 4, "Punned Structure Size");

// Register 0x42
typedef union mrmv1s_r42{
  struct{
    unsigned STR_WR_CH1_BUF_LEN		: 14;
    unsigned NOT_DEFINED_66_14		: 1;
    unsigned NOT_DEFINED_66_15		: 1;
    unsigned NOT_DEFINED_66_16		: 1;
    unsigned NOT_DEFINED_66_17		: 1;
    unsigned NOT_DEFINED_66_18		: 1;
    unsigned NOT_DEFINED_66_19		: 1;
    unsigned NOT_DEFINED_66_20		: 1;
    unsigned STR_WR_CH1_DBLB		: 1;
    unsigned STR_WR_CH1_WRP		: 1;
    unsigned STR_WR_CH1_EN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r42_t;
#define MRMv1S_R42_DEFAULT {{0x3FFF, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1, 0x1}}
#define MRMv1S_R42_DEFAULT_AS_INT 0xC03FFF
_Static_assert(sizeof(mrmv1s_r42_t) == 4, "Punned Structure Size");

// Register 0x43
typedef union mrmv1s_r43{
  struct{
    unsigned STR_WR_CH1_BUF_OFF		: 14;
  };
  uint32_t as_int;
} mrmv1s_r43_t;
#define MRMv1S_R43_DEFAULT {{0x0000}}
#define MRMv1S_R43_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r43_t) == 4, "Punned Structure Size");

// Register 0x44
typedef union mrmv1s_r44{
  struct{
    unsigned NOT_DEFINED_68_0		: 1;
    unsigned NOT_DEFINED_68_1		: 1;
    unsigned NOT_DEFINED_68_2		: 1;
    unsigned NOT_DEFINED_68_3		: 1;
    unsigned NOT_DEFINED_68_4		: 1;
    unsigned NOT_DEFINED_68_5		: 1;
    unsigned NOT_DEFINED_68_6		: 1;
    unsigned NOT_DEFINED_68_7		: 1;
    unsigned NOT_DEFINED_68_8		: 1;
    unsigned NOT_DEFINED_68_9		: 1;
    unsigned NOT_DEFINED_68_10		: 1;
    unsigned NOT_DEFINED_68_11		: 1;
    unsigned NOT_DEFINED_68_12		: 1;
    unsigned NOT_DEFINED_68_13		: 1;
    unsigned NOT_DEFINED_68_14		: 1;
    unsigned NOT_DEFINED_68_15		: 1;
    unsigned STR_WR_CH0_ALT_ADDR		: 8;
  };
  uint32_t as_int;
} mrmv1s_r44_t;
#define MRMv1S_R44_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0xF0}}
#define MRMv1S_R44_DEFAULT_AS_INT 0xF00000
_Static_assert(sizeof(mrmv1s_r44_t) == 4, "Punned Structure Size");

// Register 0x45
typedef union mrmv1s_r45{
  struct{
    unsigned NOT_DEFINED_69_0		: 1;
    unsigned NOT_DEFINED_69_1		: 1;
    unsigned NOT_DEFINED_69_2		: 1;
    unsigned NOT_DEFINED_69_3		: 1;
    unsigned NOT_DEFINED_69_4		: 1;
    unsigned NOT_DEFINED_69_5		: 1;
    unsigned NOT_DEFINED_69_6		: 1;
    unsigned NOT_DEFINED_69_7		: 1;
    unsigned NOT_DEFINED_69_8		: 1;
    unsigned NOT_DEFINED_69_9		: 1;
    unsigned NOT_DEFINED_69_10		: 1;
    unsigned NOT_DEFINED_69_11		: 1;
    unsigned NOT_DEFINED_69_12		: 1;
    unsigned NOT_DEFINED_69_13		: 1;
    unsigned NOT_DEFINED_69_14		: 1;
    unsigned NOT_DEFINED_69_15		: 1;
    unsigned STR_WR_CH0_ALT_REG_WR		: 8;
  };
  uint32_t as_int;
} mrmv1s_r45_t;
#define MRMv1S_R45_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x00}}
#define MRMv1S_R45_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r45_t) == 4, "Punned Structure Size");

// Register 0x46
typedef union mrmv1s_r46{
  struct{
    unsigned STR_WR_CH0_BUF_LEN		: 14;
    unsigned NOT_DEFINED_70_14		: 1;
    unsigned NOT_DEFINED_70_15		: 1;
    unsigned NOT_DEFINED_70_16		: 1;
    unsigned NOT_DEFINED_70_17		: 1;
    unsigned NOT_DEFINED_70_18		: 1;
    unsigned NOT_DEFINED_70_19		: 1;
    unsigned NOT_DEFINED_70_20		: 1;
    unsigned STR_WR_CH0_DBLB		: 1;
    unsigned STR_WR_CH0_WRP		: 1;
    unsigned STR_WR_CH0_EN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r46_t;
#define MRMv1S_R46_DEFAULT {{0x3FFF, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1, 0x1}}
#define MRMv1S_R46_DEFAULT_AS_INT 0xC03FFF
_Static_assert(sizeof(mrmv1s_r46_t) == 4, "Punned Structure Size");

// Register 0x47
typedef union mrmv1s_r47{
  struct{
    unsigned STR_WR_CH0_BUF_OFF		: 14;
  };
  uint32_t as_int;
} mrmv1s_r47_t;
#define MRMv1S_R47_DEFAULT {{0x0000}}
#define MRMv1S_R47_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r47_t) == 4, "Punned Structure Size");

// Register 0x48
// -- EMPTY --

// Register 0x49
// -- EMPTY --

// Register 0x4A
typedef union mrmv1s_r4A{
  struct{
    unsigned NOT_DEFINED_74_0		: 1;
    unsigned NOT_DEFINED_74_1		: 1;
    unsigned NOT_DEFINED_74_2		: 1;
    unsigned NOT_DEFINED_74_3		: 1;
    unsigned NOT_DEFINED_74_4		: 1;
    unsigned NOT_DEFINED_74_5		: 1;
    unsigned NOT_DEFINED_74_6		: 1;
    unsigned NOT_DEFINED_74_7		: 1;
    unsigned NOT_DEFINED_74_8		: 1;
    unsigned NOT_DEFINED_74_9		: 1;
    unsigned NOT_DEFINED_74_10		: 1;
    unsigned NOT_DEFINED_74_11		: 1;
    unsigned NOT_DEFINED_74_12		: 1;
    unsigned NOT_DEFINED_74_13		: 1;
    unsigned NOT_DEFINED_74_14		: 1;
    unsigned NOT_DEFINED_74_15		: 1;
    unsigned NOT_DEFINED_74_16		: 1;
    unsigned NOT_DEFINED_74_17		: 1;
    unsigned NOT_DEFINED_74_18		: 1;
    unsigned NOT_DEFINED_74_19		: 1;
    unsigned NOT_DEFINED_74_20		: 1;
    unsigned NOT_DEFINED_74_21		: 1;
    unsigned NOT_DEFINED_74_22		: 1;
    unsigned BLK_WR_EN		: 1;
  };
  uint32_t as_int;
} mrmv1s_r4A_t;
#define MRMv1S_R4A_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
#define MRMv1S_R4A_DEFAULT_AS_INT 0x800000
_Static_assert(sizeof(mrmv1s_r4A_t) == 4, "Punned Structure Size");

// Register 0x4B
// -- EMPTY --

// Register 0x4C
// -- EMPTY --

// Register 0x4D
// -- EMPTY --

// Register 0x4E
// -- EMPTY --

// Register 0x4F
// -- EMPTY --

// Register 0x50
// -- EMPTY --

// Register 0x51
// -- EMPTY --

// Register 0x52
// -- EMPTY --

// Register 0x53
// -- EMPTY --

// Register 0x54
// -- EMPTY --

// Register 0x55
// -- EMPTY --

// Register 0x56
// -- EMPTY --

// Register 0x57
typedef union mrmv1s_r57{
  struct{
    unsigned NOT_DEFINED_87_0		: 1;
    unsigned NOT_DEFINED_87_1		: 1;
    unsigned NOT_DEFINED_87_2		: 1;
    unsigned NOT_DEFINED_87_3		: 1;
    unsigned NOT_DEFINED_87_4		: 1;
    unsigned NOT_DEFINED_87_5		: 1;
    unsigned NOT_DEFINED_87_6		: 1;
    unsigned NOT_DEFINED_87_7		: 1;
    unsigned NOT_DEFINED_87_8		: 1;
    unsigned NOT_DEFINED_87_9		: 1;
    unsigned NOT_DEFINED_87_10		: 1;
    unsigned NOT_DEFINED_87_11		: 1;
    unsigned NOT_DEFINED_87_12		: 1;
    unsigned NOT_DEFINED_87_13		: 1;
    unsigned NOT_DEFINED_87_14		: 1;
    unsigned NOT_DEFINED_87_15		: 1;
    unsigned NOT_DEFINED_87_16		: 1;
    unsigned NOT_DEFINED_87_17		: 1;
    unsigned NOT_DEFINED_87_18		: 1;
    unsigned NOT_DEFINED_87_19		: 1;
    unsigned NOT_DEFINED_87_20		: 1;
    unsigned NOT_DEFINED_87_21		: 1;
    unsigned NOT_DEFINED_87_22		: 1;
    unsigned ACT_RST		: 1;
  };
  uint32_t as_int;
} mrmv1s_r57_t;
#define MRMv1S_R57_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
#define MRMv1S_R57_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(mrmv1s_r57_t) == 4, "Punned Structure Size");

#endif // MRMV1S_RF_H