//************************************************************
// Desciption: SIRv2B Register File Header File
//      Generated by genRF 12/10/2015 18:18:36
//************************************************************

#ifndef SIRV2B_RF_H
#define SIRV2B_RF_H

// Register 0x00
typedef union sirv2b_r00{
  struct{
    unsigned SIR_RSTn		: 1;
    unsigned SIR_START		: 1;
    unsigned SIR_WAKEUP_PERIOD		: 7;
    unsigned SIR_FASTCLK_POWERON_LEN		: 4;
    unsigned SIR_FASTCLK_STAB_LEN		: 11;
  };
  uint32_t as_int;
} sirv2b_r00_t;
#define SIRv2B_R00_DEFAULT {{0x0, 0x0, 0x02, 0x2, 0x07F}}
_Static_assert(sizeof(sirv2b_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union sirv2b_r01{
  struct{
    unsigned SIR_RSTn_SLOSC		: 1;
    unsigned SIR_BBFSM_POWERON_LEN		: 4;
    unsigned SIR_MODE		: 3;
    unsigned SIR_SLOSC_FREQ		: 3;
    unsigned SIR_DIG_MONITOR_SEL1		: 3;
    unsigned SIR_DIG_MONITOR_SEL2		: 3;
    unsigned SIR_EN_DIG_MONITOR		: 1;
    unsigned SIR_AMP_I_LEVEL_SEL		: 6;
  };
  uint32_t as_int;
} sirv2b_r01_t;
#define SIRv2B_R01_DEFAULT {{0x0, 0x4, 0x0, 0x0, 0x2, 0x2, 0x0, 0x33}}
_Static_assert(sizeof(sirv2b_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union sirv2b_r02{
  struct{
    unsigned SIR_AMP_I_TC_SEL		: 3;
    unsigned SIR_DIV_SEL		: 4;
    unsigned SIR_I_LEVEL_SELB		: 7;
    unsigned SIR_I_TC_SEL		: 3;
    unsigned SIR_VINHEE_SEL		: 3;
    unsigned SIR_FREQ_DIV		: 2;
    unsigned SIR_FASTCLK_OVERRIDE		: 1;
  };
  uint32_t as_int;
} sirv2b_r02_t;
#define SIRv2B_R02_DEFAULT {{0x3, 0x8, 0x7A, 0x1, 0x4, 0x0, 0x0}}
_Static_assert(sizeof(sirv2b_r02_t) == 4, "Punned Structure Size");

// Register 0x03
typedef union sirv2b_r03{
  struct{
    unsigned SIR_R_SEL		: 11;
    unsigned SIR_TX_POWERON_LEN		: 3;
    unsigned SIR_TX_HDR_BITS		: 5;
    unsigned SIR_TX_HDR_SCALE		: 2;
    unsigned SIR_SLOSC_FREQ_DIV		: 3;
  };
  uint32_t as_int;
} sirv2b_r03_t;
#define SIRv2B_R03_DEFAULT {{0x4FF, 0x2, 0x10, 0x0, 0x0}}
_Static_assert(sizeof(sirv2b_r03_t) == 4, "Punned Structure Size");

// Register 0x04
typedef union sirv2b_r04{
  struct{
    unsigned SIR_SEED		: 6;
    unsigned SIR_TX_DATA_BITS		: 7;
    unsigned SIR_TX_PULSE_POS		: 3;
    unsigned SIR_PRECHARGE_LEN		: 4;
  };
  uint32_t as_int;
} sirv2b_r04_t;
#define SIRv2B_R04_DEFAULT {{0x04, 0x10, 0x7, 0x4}}
_Static_assert(sizeof(sirv2b_r04_t) == 4, "Punned Structure Size");

// Register 0x05
typedef union sirv2b_r05{
  struct{
    unsigned SIR_TX_DATA_00		: 24;
  };
  uint32_t as_int;
} sirv2b_r05_t;
#define SIRv2B_R05_DEFAULT {{0x003333}}
_Static_assert(sizeof(sirv2b_r05_t) == 4, "Punned Structure Size");

// Register 0x06
typedef union sirv2b_r06{
  struct{
    unsigned SIR_TX_DATA_01		: 24;
  };
  uint32_t as_int;
} sirv2b_r06_t;
#define SIRv2B_R06_DEFAULT {{0x000000}}
_Static_assert(sizeof(sirv2b_r06_t) == 4, "Punned Structure Size");

// Register 0x07
typedef union sirv2b_r07{
  struct{
    unsigned SIR_TX_DATA_02		: 24;
  };
  uint32_t as_int;
} sirv2b_r07_t;
#define SIRv2B_R07_DEFAULT {{0x000000}}
_Static_assert(sizeof(sirv2b_r07_t) == 4, "Punned Structure Size");

// Register 0x08
typedef union sirv2b_r08{
  struct{
    unsigned SIR_TX_DATA_03		: 24;
  };
  uint32_t as_int;
} sirv2b_r08_t;
#define SIRv2B_R08_DEFAULT {{0x000000}}
_Static_assert(sizeof(sirv2b_r08_t) == 4, "Punned Structure Size");

// Register 0x09
typedef union sirv2b_r09{
  struct{
    unsigned SIR_CAP_LEN		: 9;
    unsigned SIR_GUARD_LEN		: 10;
    unsigned SIR_ED_LOAD_CAP		: 5;
  };
  uint32_t as_int;
} sirv2b_r09_t;
#define SIRv2B_R09_DEFAULT {{0x07D, 0x001, 0x02}}
_Static_assert(sizeof(sirv2b_r09_t) == 4, "Punned Structure Size");

// Register 0x0A
typedef union sirv2b_r0A{
  struct{
    unsigned SIR_RX_SAMPLE_LEN		: 3;
    unsigned SIR_RX_HDR_BITS		: 6;
    unsigned SIR_RX_HDR_TH		: 6;
    unsigned SIR_IRQ_SYNC_FAIL		: 1;
    unsigned SIR_RX_DATA_BITS		: 7;
  };
  uint32_t as_int;
} sirv2b_r0A_t;
#define SIRv2B_R0A_DEFAULT {{0x0, 0x18, 0x15, 0x1, 0x30}}
_Static_assert(sizeof(sirv2b_r0A_t) == 4, "Punned Structure Size");

// Register 0x0B
typedef union sirv2b_r0B{
  struct{
    unsigned SIR_RX_POWERON_LEN		: 6;
    unsigned SIR_I_AMP_TUNE		: 6;
    unsigned SIR_I_BUF_TUNE		: 6;
    unsigned SIR_I_ED_TUNE		: 6;
  };
  uint32_t as_int;
} sirv2b_r0B_t;
#define SIRv2B_R0B_DEFAULT {{0x28, 0x1D, 0x06, 0x03}}
_Static_assert(sizeof(sirv2b_r0B_t) == 4, "Punned Structure Size");

// Register 0x0C
typedef union sirv2b_r0C{
  struct{
    unsigned SIR_SAMPLE_CAP		: 3;
    unsigned SIR_EN_5STAGE		: 1;
    unsigned SIR_EN_4STAGE		: 1;
    unsigned SIR_EN_3STAGE		: 1;
    unsigned SIR_EN_RX_OVERRIDE		: 1;
    unsigned SIR_EN_RX_BBFSM_SEL		: 1;
    unsigned SIR_CL_CTRL		: 6;
    unsigned SIR_EN_TX_OVERRIDE		: 1;
    unsigned SIR_EN_TX_BBFSM_SEL		: 1;
    unsigned SIR_TAIL_CURRENT		: 4;
  };
  uint32_t as_int;
} sirv2b_r0C_t;
#define SIRv2B_R0C_DEFAULT {{0x0, 0x1, 0x0, 0x0, 0x1, 0x1, 0x10, 0x0, 0x1, 0x4}}
_Static_assert(sizeof(sirv2b_r0C_t) == 4, "Punned Structure Size");

// Register 0x0D
typedef union sirv2b_r0D{
  struct{
    unsigned SIR_PULSE_MODE		: 1;
    unsigned SIR_TX_PW		: 4;
    unsigned SIR_TX_TANK_CAPA		: 4;
    unsigned SIR_TX_TANK_CAPB		: 4;
    unsigned SIR_RX_TANK_CAPA		: 4;
    unsigned SIR_RX_TANK_CAPB		: 4;
    unsigned SIR_TANK_CAP_BBFSM_SEL		: 1;
  };
  uint32_t as_int;
} sirv2b_r0D_t;
#define SIRv2B_R0D_DEFAULT {{0x1, 0x6, 0x0, 0x0, 0xF, 0xF, 0x1}}
_Static_assert(sizeof(sirv2b_r0D_t) == 4, "Punned Structure Size");

// Register 0x0E
typedef union sirv2b_r0E{
  struct{
    unsigned SIR_TANK_CAP_A_OVERRIDE		: 4;
    unsigned SIR_TANK_CAP_B_OVERRIDE		: 4;
    unsigned SIR_TANK_SHORT_A_OVERRIDE		: 1;
    unsigned SIR_TANK_SHORT_B_OVERRIDE		: 1;
  };
  uint32_t as_int;
} sirv2b_r0E_t;
#define SIRv2B_R0E_DEFAULT {{0x0, 0x0, 0x0, 0x0}}
_Static_assert(sizeof(sirv2b_r0E_t) == 4, "Punned Structure Size");

// Register 0x0F
// -- READ-ONLY --

// Register 0x10
// -- READ-ONLY --

// Register 0x11
// -- READ-ONLY --

// Register 0x12
// -- READ-ONLY --

// Register 0x13
// -- READ-ONLY --

// Register 0x14
// -- READ-ONLY --

// Register 0x15
// -- READ-ONLY --

// Register 0x16
typedef union sirv2b_r16{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
    unsigned SIR_IRQ_EN		: 1;
  };
  uint32_t as_int;
} sirv2b_r16_t;
#define SIRv2B_R16_DEFAULT {{0x1, 0x2, 0x1}}
_Static_assert(sizeof(sirv2b_r16_t) == 4, "Punned Structure Size");

// Register 0x17
typedef union sirv2b_r17{
  struct{
    unsigned SIR_IRQ_PACKET		: 24;
  };
  uint32_t as_int;
} sirv2b_r17_t;
#define SIRv2B_R17_DEFAULT {{0x001400}}
_Static_assert(sizeof(sirv2b_r17_t) == 4, "Punned Structure Size");

#endif // SIRV2B_RF_H