//************************************************************
// Desciption: SATv1 Register File Header File
//      Generated by genRF (Version 1.51) 05/23/2023 12:01:53
//************************************************************

#ifndef SATV1_RF_H
#define SATV1_RF_H

// Register 0x00
typedef union sat_r00{
  struct{
    unsigned LDO_EN_LDO		: 1;
    unsigned LDO_EN_IREF		: 1;
    unsigned LDO_EN_VREF		: 1;
    unsigned LDO_SEL_VOUT		: 3;
    unsigned LDO_VREF_I_AMP		: 4;
  };
  uint32_t as_int;
} sat_r00_t;
#define SAT_R00_DEFAULT {{0x0, 0x0, 0x0, 0x4, 0x0}}
#define SAT_R00_DEFAULT_AS_INT 0x000020
_Static_assert(sizeof(sat_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union sat_r01{
  struct{
    unsigned TSNS_RESETn		: 1;
    unsigned TSNS_ISOLATE		: 1;
    unsigned TSNS_SEL_V1P2		: 1;
    unsigned TSNS_SEL_LDO		: 1;
    unsigned TSNS_EN_SENSOR_V1P2		: 1;
    unsigned TSNS_EN_SENSOR_LDO		: 1;
    unsigned TSNS_BURST_MODE		: 1;
    unsigned TSNS_CONT_MODE		: 1;
    unsigned TSNS_EN_IRQ		: 1;
    unsigned TSNS_EN_CLK_SENS		: 1;
    unsigned TSNS_EN_CLK_REF		: 1;
    unsigned TSNS_FORCE_CLR_IRQ_IF_EN_IRQ_0		: 1;
  };
  uint32_t as_int;
} sat_r01_t;
#define SAT_R01_DEFAULT {{0x0, 0x1, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
#define SAT_R01_DEFAULT_AS_INT 0x000802
_Static_assert(sizeof(sat_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union sat_r02{
  struct{
    unsigned TSNS_I_SOSC		: 4;
    unsigned TSNS_I_MIRROR		: 2;
    unsigned TSNS_I_CMP		: 4;
    unsigned TSNS_I_BUF2		: 4;
    unsigned TSNS_I_BUF		: 4;
    unsigned TSNS_R_REF		: 4;
  };
  uint32_t as_int;
} sat_r02_t;
#define SAT_R02_DEFAULT {{0x0, 0x1, 0x1, 0x0, 0x0, 0x8}}
#define SAT_R02_DEFAULT_AS_INT 0x200050
_Static_assert(sizeof(sat_r02_t) == 4, "Punned Structure Size");

// Register 0x03
typedef union sat_r03{
  struct{
    unsigned TSNS_SEL_CONV_TIME		: 4;
    unsigned TSNS_SEL_REF_STB_TIME		: 2;
    unsigned TSNS_SEL_STB_TIME		: 3;
    unsigned TSNS_SEL_VVDD		: 4;
    unsigned TSNS_MOM		: 3;
    unsigned TSNS_MIM		: 3;
  };
  uint32_t as_int;
} sat_r03_t;
#define SAT_R03_DEFAULT {{0x6, 0x2, 0x1, 0xE, 0x4, 0x4}}
#define SAT_R03_DEFAULT_AS_INT 0x049C66
_Static_assert(sizeof(sat_r03_t) == 4, "Punned Structure Size");

// Register 0x04
typedef union sat_r04{
  struct{
    unsigned TSNS_PDIFF		: 15;
  };
  uint32_t as_int;
} sat_r04_t;
#define SAT_R04_DEFAULT {{0x0200}}
#define SAT_R04_DEFAULT_AS_INT 0x000200
_Static_assert(sizeof(sat_r04_t) == 4, "Punned Structure Size");

// Register 0x05
typedef union sat_r05{
  struct{
    unsigned TSNS_POLY		: 24;
  };
  uint32_t as_int;
} sat_r05_t;
#define SAT_R05_DEFAULT {{0x004000}}
#define SAT_R05_DEFAULT_AS_INT 0x004000
_Static_assert(sizeof(sat_r05_t) == 4, "Punned Structure Size");

// Register 0x06
// -- READ-ONLY --

// Register 0x07
typedef union sat_r07{
  struct{
    unsigned TSNS_INT_RPLY_REG_ADDR		: 8;
    unsigned TSNS_INT_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} sat_r07_t;
#define SAT_R07_DEFAULT {{0x00, 0x10}}
#define SAT_R07_DEFAULT_AS_INT 0x001000
_Static_assert(sizeof(sat_r07_t) == 4, "Punned Structure Size");

// Register 0x08
typedef union sat_r08{
  struct{
    unsigned TMR_EN_SELF_CLK		: 1;
    unsigned TMR_RESETB_DCDC		: 1;
    unsigned TMR_RESETB_DIV		: 1;
    unsigned TMR_EN_OSC		: 1;
    unsigned TMR_RESETB		: 1;
    unsigned TMR_ISOLATE		: 1;
    unsigned TMR_SLEEP		: 1;
  };
  uint32_t as_int;
} sat_r08_t;
#define SAT_R08_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x1, 0x1}}
#define SAT_R08_DEFAULT_AS_INT 0x000060
_Static_assert(sizeof(sat_r08_t) == 4, "Punned Structure Size");

// Register 0x09
typedef union sat_r09{
  struct{
    unsigned TMR_EN_TUNE2		: 1;
    unsigned TMR_EN_TUNE1		: 1;
    unsigned TMR_SEL_DCAP		: 6;
    unsigned TMR_SEL_CAP		: 8;
    unsigned TMR_CASCODE_BOOST		: 1;
    unsigned TMR_IBIAS_REF		: 4;
    unsigned TMR_SELF_EN		: 1;
    unsigned TMR_SEL_CLK_OSC		: 1;
    unsigned TMR_SEL_CLK_DIV		: 1;
  };
  uint32_t as_int;
} sat_r09_t;
#define SAT_R09_DEFAULT {{0x1, 0x1, 0x3F, 0x80, 0x0, 0x4, 0x1, 0x1, 0x0}}
#define SAT_R09_DEFAULT_AS_INT 0x6880FF
_Static_assert(sizeof(sat_r09_t) == 4, "Punned Structure Size");

// Register 0x0A
typedef union sat_r0A{
  struct{
    unsigned TMR_AFC		: 3;
    unsigned TMR_SAMPLE_EN		: 1;
    unsigned TMR_EN_TUNE2_RES		: 1;
    unsigned TMR_EN_TUNE1_RES		: 1;
    unsigned NOT_DEFINED_10_6		: 1;
    unsigned TMR_DIFF_CON		: 14;
    unsigned TMR_S		: 3;
  };
  uint32_t as_int;
} sat_r0A_t;
#define SAT_R0A_DEFAULT {{0x4, 0x1, 0x1, 0x1, 0x0, 0x3FFF, 0x1}}
#define SAT_R0A_DEFAULT_AS_INT 0x3FFFBC
_Static_assert(sizeof(sat_r0A_t) == 4, "Punned Structure Size");

// Register 0x0B
typedef union sat_r0B{
  struct{
    unsigned TMR_TFR_CON		: 4;
  };
  uint32_t as_int;
} sat_r0B_t;
#define SAT_R0B_DEFAULT {{0xF}}
#define SAT_R0B_DEFAULT_AS_INT 0x00000F
_Static_assert(sizeof(sat_r0B_t) == 4, "Punned Structure Size");

// Register 0x0C
typedef union sat_r0C{
  struct{
    unsigned ACC_VREF_TUNEB		: 7;
    unsigned ACC_ENb_LDO		: 1;
    unsigned ACC_I_SEL		: 3;
    unsigned ACC_I_SELB		: 3;
    unsigned ACC_ISOL_CP_CLK		: 1;
    unsigned ACC_SEL_CP_CLK		: 2;
  };
  uint32_t as_int;
} sat_r0C_t;
#define SAT_R0C_DEFAULT {{0x00, 0x1, 0x6, 0x3, 0x1, 0x0}}
#define SAT_R0C_DEFAULT_AS_INT 0x005E80
_Static_assert(sizeof(sat_r0C_t) == 4, "Punned Structure Size");

// Register 0x0D
typedef union sat_r0D{
  struct{
    unsigned ACC_DIV1		: 14;
  };
  uint32_t as_int;
} sat_r0D_t;
#define SAT_R0D_DEFAULT {{0x007F}}
#define SAT_R0D_DEFAULT_AS_INT 0x00007F
_Static_assert(sizeof(sat_r0D_t) == 4, "Punned Structure Size");

// Register 0x0E
typedef union sat_r0E{
  struct{
    unsigned ACC_DIV2		: 14;
  };
  uint32_t as_int;
} sat_r0E_t;
#define SAT_R0E_DEFAULT {{0x0083}}
#define SAT_R0E_DEFAULT_AS_INT 0x000083
_Static_assert(sizeof(sat_r0E_t) == 4, "Punned Structure Size");

// Register 0x0F
typedef union sat_r0F{
  struct{
    unsigned ACC_RESETB_SAFR		: 1;
    unsigned ACC_ISOL_SAFR_CLK		: 1;
    unsigned ACC_SEL_SMP_CLK		: 1;
    unsigned ACC_DSM_ENB		: 1;
    unsigned ACC_DSM_IN		: 6;
    unsigned ACC_RESETB_MD		: 1;
    unsigned ACC_ISOL_MD		: 1;
  };
  uint32_t as_int;
} sat_r0F_t;
#define SAT_R0F_DEFAULT {{0x0, 0x1, 0x0, 0x1, 0x1F, 0x0, 0x1}}
#define SAT_R0F_DEFAULT_AS_INT 0x0009FA
_Static_assert(sizeof(sat_r0F_t) == 4, "Punned Structure Size");

// Register 0x10
// -- MEMORY-MAPPED --

// Register 0x11
// -- MEMORY-MAPPED --

// Register 0x12
// -- READ-ONLY --

// Register 0x13
typedef union sat_r13{
  struct{
    unsigned ACC_SCAN_PHI		: 1;
    unsigned ACC_SCAN_PHI_BAR		: 1;
    unsigned ACC_SCAN_DATA_IN		: 1;
    unsigned ACC_SCAN_LOAD_CHIP		: 1;
    unsigned ACC_INT_RPLY_REG_ADDR		: 8;
    unsigned ACC_INT_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} sat_r13_t;
#define SAT_R13_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x06, 0x10}}
#define SAT_R13_DEFAULT_AS_INT 0x010060
_Static_assert(sizeof(sat_r13_t) == 4, "Punned Structure Size");

// Register 0x14
// -- MEMORY-MAPPED --

// Register 0x15
// -- READ-ONLY --

// Register 0x16
// -- READ-ONLY --

// Register 0x17
typedef union sat_r17{
  struct{
    unsigned WUP_INT_RPLY_REG_ADDR		: 8;
    unsigned WUP_INT_RPLY_SHORT_ADDR		: 8;
    unsigned WUP_INT_RPLY_NUM_REGS_1		: 3;
    unsigned WUP_ENABLE_CLK_SLP_OUT		: 1;
    unsigned WUP_CLK_SEL		: 1;
    unsigned WUP_AUTO_RESET		: 1;
    unsigned WUP_IRQ_EN		: 1;
    unsigned WUP_ENABLE		: 1;
  };
  uint32_t as_int;
} sat_r17_t;
#define SAT_R17_DEFAULT {{0x07, 0x10, 0x0, 0x0, 0x0, 0x1, 0x1, 0x0}}
#define SAT_R17_DEFAULT_AS_INT 0x601007
_Static_assert(sizeof(sat_r17_t) == 4, "Punned Structure Size");

// Register 0x18
typedef union sat_r18{
  struct{
    unsigned WUP_INT_RPLY_PAYLOAD		: 24;
  };
  uint32_t as_int;
} sat_r18_t;
#define SAT_R18_DEFAULT {{0x023006}}
#define SAT_R18_DEFAULT_AS_INT 0x023006
_Static_assert(sizeof(sat_r18_t) == 4, "Punned Structure Size");

// Register 0x19
typedef union sat_r19{
  struct{
    unsigned WUP_THRESHOLD_EXT		: 8;
    unsigned WUP_TH_INT_RPLY_REG_ADDR		: 8;
    unsigned WUP_TH_INT_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} sat_r19_t;
#define SAT_R19_DEFAULT {{0x00, 0x07, 0x10}}
#define SAT_R19_DEFAULT_AS_INT 0x100700
_Static_assert(sizeof(sat_r19_t) == 4, "Punned Structure Size");

// Register 0x1A
typedef union sat_r1A{
  struct{
    unsigned WUP_THRESHOLD		: 24;
  };
  uint32_t as_int;
} sat_r1A_t;
#define SAT_R1A_DEFAULT {{0x000000}}
#define SAT_R1A_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(sat_r1A_t) == 4, "Punned Structure Size");

// Register 0x1B
// -- READ-ONLY --

// Register 0x1C
// -- READ-ONLY --

// Register 0x1D
typedef union sat_r1D{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
  };
  uint32_t as_int;
} sat_r1D_t;
#define SAT_R1D_DEFAULT {{0x1, 0x2}}
#define SAT_R1D_DEFAULT_AS_INT 0x000009
_Static_assert(sizeof(sat_r1D_t) == 4, "Punned Structure Size");

// Register 0x1E
// -- EMPTY --

// Register 0x1F
// -- EMPTY --

// Register 0x20
typedef union sat_r20{
  struct{
    unsigned RF2_SLEEP		: 1;
    unsigned RF2_ISOLATE		: 1;
  };
  uint32_t as_int;
} sat_r20_t;
#define SAT_R20_DEFAULT {{0x0, 0x0}}
#define SAT_R20_DEFAULT_AS_INT 0x000000
_Static_assert(sizeof(sat_r20_t) == 4, "Punned Structure Size");

#endif // SATV1_RF_H
