//************************************************************
// Desciption: RDCv2 Register File Header File
//      Generated by genRF (Version 1.03) 10/09/2017 00:49:57
//************************************************************

#ifndef RDCV2_RF_H
#define RDCV2_RF_H

// Register 0x00
typedef union rdcv2_r00{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
    unsigned MBUS_IGNORE_RX_FAIL		: 1;
  };
  uint32_t as_int;
} rdcv2_r00_t;
#define RDCv2_R00_DEFAULT {{0x1, 0x2, 0x1}}
_Static_assert(sizeof(rdcv2_r00_t) == 4, "Punned Structure Size");

// Register 0x01
// -- EMPTY --

// Register 0x02
// -- EMPTY --

// Register 0x03
// -- EMPTY --

// Register 0x04
// -- EMPTY --

// Register 0x05
// -- EMPTY --

// Register 0x06
// -- EMPTY --

// Register 0x07
// -- EMPTY --

// Register 0x08
// -- EMPTY --

// Register 0x09
// -- EMPTY --

// Register 0x0A
// -- EMPTY --

// Register 0x0B
// -- EMPTY --

// Register 0x0C
// -- EMPTY --

// Register 0x0D
// -- EMPTY --

// Register 0x0E
// -- EMPTY --

// Register 0x0F
// -- EMPTY --

// Register 0x10
typedef union rdcv2_r10{
  struct{
    unsigned BRDC_IRQ_REG_ADDR		: 8;
    unsigned BRDC_IRQ_SHORT_ADDR		: 8;
    unsigned NOT_DEFINED_16_16		: 1;
    unsigned NOT_DEFINED_16_17		: 1;
    unsigned NOT_DEFINED_16_18		: 1;
    unsigned NOT_DEFINED_16_19		: 1;
    unsigned NOT_DEFINED_16_20		: 1;
    unsigned NOT_DEFINED_16_21		: 1;
    unsigned BRDC_WAKEUP_WHEN_DONE		: 1;
    unsigned BRDC_IRQ_ENABLE		: 1;
  };
  uint32_t as_int;
} rdcv2_r10_t;
#define RDCv2_R10_DEFAULT {{0x00, 0x10, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(rdcv2_r10_t) == 4, "Punned Structure Size");

// Register 0x11
typedef union rdcv2_r11{
  struct{
    unsigned BRDC_IRQ_PAYLOAD_ADDR		: 8;
    unsigned BRDC_IRQ_LENGTH_1		: 8;
  };
  uint32_t as_int;
} rdcv2_r11_t;
#define RDCv2_R11_DEFAULT {{0x21, 0x00}}
_Static_assert(sizeof(rdcv2_r11_t) == 4, "Punned Structure Size");

// Register 0x12
typedef union rdcv2_r12{
  struct{
    unsigned BRDC_OSC_RESET		: 1;
    unsigned BRDC_IB_ENB		: 1;
    unsigned BRDC_RSTB		: 1;
  };
  uint32_t as_int;
} rdcv2_r12_t;
#define RDCv2_R12_DEFAULT {{0x1, 0x1, 0x0}}
_Static_assert(sizeof(rdcv2_r12_t) == 4, "Punned Structure Size");

// Register 0x13
typedef union rdcv2_r13{
  struct{
    unsigned BRDC_ISOLATE_DOUT		: 1;
    unsigned BRDC_OSC_ISOLATE		: 1;
    unsigned BRDC_OSC_V1P2_PG_EN		: 1;
    unsigned BRDC_V1P2_PG_EN		: 1;
    unsigned BRDC_V3P6_ISOLB		: 1;
    unsigned BRDC_V3P6_PG_EN		: 1;
    unsigned BRDC_ISOLATE		: 1;
  };
  uint32_t as_int;
} rdcv2_r13_t;
#define RDCv2_R13_DEFAULT {{0x1, 0x1, 0x1, 0x1, 0x0, 0x1, 0x1}}
_Static_assert(sizeof(rdcv2_r13_t) == 4, "Punned Structure Size");

// Register 0x14
typedef union rdcv2_r14{
  struct{
    unsigned BRDC_MODES		: 2;
    unsigned BRDC_VEXSPL_SEL		: 2;
    unsigned BRDC_OFS_CAL_ON		: 1;
    unsigned BRDC_MAN_SHORT_EN_VALUE		: 1;
    unsigned BRDC_MAN_SHORT_EN		: 1;
    unsigned BRDC_LDO_CC_SEL		: 2;
    unsigned BRDC_LDO_2ND_I_SEL		: 2;
    unsigned BRDC_IBC_LDO		: 6;
    unsigned BRDC_COMP_OUT_INV		: 1;
    unsigned BRDC_COMP_COUNT_SEL		: 3;
    unsigned BRDC_COMP3V_OUT_INV		: 1;
    unsigned BRDC_EXT_CLK_SEL		: 1;
    unsigned BRDC_OFS_INV		: 1;
  };
  uint32_t as_int;
} rdcv2_r14_t;
#define RDCv2_R14_DEFAULT {{0x0, 0x2, 0x0, 0x0, 0x0, 0x2, 0x2, 0x0C, 0x0, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(rdcv2_r14_t) == 4, "Punned Structure Size");

// Register 0x15
typedef union rdcv2_r15{
  struct{
    unsigned BRDC_MBOTSEL_UPPER		: 15;
    unsigned NOT_DEFINED_21_15		: 1;
    unsigned BRDC_MBOT_SEARCH_EN		: 1;
  };
  uint32_t as_int;
} rdcv2_r15_t;
#define RDCv2_R15_DEFAULT {{0x0000, 0x0, 0x0}}
_Static_assert(sizeof(rdcv2_r15_t) == 4, "Punned Structure Size");

// Register 0x16
typedef union rdcv2_r16{
  struct{
    unsigned BRDC_MBOTSEL_LOWER		: 16;
  };
  uint32_t as_int;
} rdcv2_r16_t;
#define RDCv2_R16_DEFAULT {{0x03FF}}
_Static_assert(sizeof(rdcv2_r16_t) == 4, "Punned Structure Size");

// Register 0x17
typedef union rdcv2_r17{
  struct{
    unsigned BRDC_OSC_MOM		: 3;
    unsigned BRDC_OSC_MIM		: 3;
    unsigned BRDC_OSC_I_SOSC		: 4;
    unsigned BRDC_OSC_I_MIRROR		: 2;
    unsigned BRDC_OSC_I_CMP		: 4;
    unsigned BRDC_OSC_I_BUF		: 4;
    unsigned BRDC_OSC_I_BUF2		: 4;
  };
  uint32_t as_int;
} rdcv2_r17_t;
#define RDCv2_R17_DEFAULT {{0x4, 0x4, 0x0, 0x1, 0x1, 0x0, 0x0}}
_Static_assert(sizeof(rdcv2_r17_t) == 4, "Punned Structure Size");

// Register 0x18
typedef union rdcv2_r18{
  struct{
    unsigned BRDC_OSC_PDIFF		: 15;
    unsigned NOT_DEFINED_24_15		: 1;
    unsigned BRDC_OSC_R_REF		: 4;
  };
  uint32_t as_int;
} rdcv2_r18_t;
#define RDCv2_R18_DEFAULT {{0x0200, 0x0, 0x8}}
_Static_assert(sizeof(rdcv2_r18_t) == 4, "Punned Structure Size");

// Register 0x19
typedef union rdcv2_r19{
  struct{
    unsigned BRDC_OSC_POLY		: 24;
  };
  uint32_t as_int;
} rdcv2_r19_t;
#define RDCv2_R19_DEFAULT {{0x004000}}
_Static_assert(sizeof(rdcv2_r19_t) == 4, "Punned Structure Size");

// Register 0x1A
typedef union rdcv2_r1A{
  struct{
    unsigned BRDC_TICK_VREF_SPL_REDIS_WAIT		: 3;
    unsigned BRDC_TICK_SPL_TO_SPL		: 9;
    unsigned BRDC_SAMPLE_TIME_SEL		: 4;
    unsigned BRDC_OSR		: 7;
  };
  uint32_t as_int;
} rdcv2_r1A_t;
#define RDCv2_R1A_DEFAULT {{0x2, 0x000, 0x3, 0x00}}
_Static_assert(sizeof(rdcv2_r1A_t) == 4, "Punned Structure Size");

// Register 0x1B
typedef union rdcv2_r1B{
  struct{
    unsigned BRDC_MBOT_IN_UPPER		: 15;
  };
  uint32_t as_int;
} rdcv2_r1B_t;
#define RDCv2_R1B_DEFAULT {{0x0000}}
_Static_assert(sizeof(rdcv2_r1B_t) == 4, "Punned Structure Size");

// Register 0x1C
typedef union rdcv2_r1C{
  struct{
    unsigned BRDC_MBOT_IN_LOWER		: 16;
  };
  uint32_t as_int;
} rdcv2_r1C_t;
#define RDCv2_R1C_DEFAULT {{0x03FF}}
_Static_assert(sizeof(rdcv2_r1C_t) == 4, "Punned Structure Size");

// Register 0x1D
typedef union rdcv2_r1D{
  struct{
    unsigned BRDC_OFSBOT_IN		: 10;
    unsigned BRDC_OFSBOT_CAL_ADJ_IN		: 10;
  };
  uint32_t as_int;
} rdcv2_r1D_t;
#define RDCv2_R1D_DEFAULT {{0x200, 0x000}}
_Static_assert(sizeof(rdcv2_r1D_t) == 4, "Punned Structure Size");

// Register 0x1E
typedef union rdcv2_r1E{
  struct{
    unsigned BRDC_INIT_IGNORE		: 5;
  };
  uint32_t as_int;
} rdcv2_r1E_t;
#define RDCv2_R1E_DEFAULT {{0x00}}
_Static_assert(sizeof(rdcv2_r1E_t) == 4, "Punned Structure Size");

// Register 0x1F
// -- EMPTY --

// Register 0x20
// -- READ-ONLY --

// Register 0x21
// -- READ-ONLY --

// Register 0x22
// -- READ-ONLY --

// Register 0x23
// -- READ-ONLY --

#endif // RDCV2_RF_H