//************************************************************
// Desciption: SNSv10 Register File Header File
//      Generated by genRF 06/11/2017 01:46:02
//************************************************************

#ifndef SNSV10_RF_H
#define SNSV10_RF_H

// Register 0x00
typedef union snsv10_r00{
  struct{
    unsigned LDO_EN_CDC_OUT		: 1;
    unsigned LDO_EN_TSNS_OUT		: 1;
    unsigned LDO_EN_IREF		: 1;
    unsigned LDO_EN_VREF		: 1;
    unsigned LDO_SEL_CDC		: 3;
    unsigned LDO_SEL_TSNS		: 3;
    unsigned LDO_VREF_I_AMP		: 4;
  };
  uint32_t as_int;
} snsv10_r00_t;
#define SNSv10_R00_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x4, 0x4, 0x0}}
_Static_assert(sizeof(snsv10_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union snsv10_r01{
  struct{
    unsigned TSNS_RESETn		: 1;
    unsigned TSNS_ISOLATE		: 1;
    unsigned TSNS_SEL_V1P2		: 1;
    unsigned TSNS_SEL_LDO		: 1;
    unsigned TSNS_EN_SENSOR_V1P2		: 1;
    unsigned TSNS_EN_SENSOR_LDO		: 1;
    unsigned TSNS_BURST_MODE		: 1;
    unsigned TSNS_CONT_MODE		: 1;
    unsigned TSNS_EN_IRQ		: 1;
    unsigned TSNS_EN_MONITOR		: 1;
  };
  uint32_t as_int;
} snsv10_r01_t;
#define SNSv10_R01_DEFAULT {{0x0, 0x1, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
_Static_assert(sizeof(snsv10_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union snsv10_r02{
  struct{
    unsigned TSNS_I_SOSC		: 4;
    unsigned TSNS_I_MIRROR		: 2;
    unsigned TSNS_I_CMP		: 4;
    unsigned TSNS_I_BUF2		: 4;
    unsigned TSNS_I_BUF		: 4;
    unsigned TSNS_R_REF		: 4;
  };
  uint32_t as_int;
} snsv10_r02_t;
#define SNSv10_R02_DEFAULT {{0x0, 0x1, 0x1, 0x0, 0x0, 0x8}}
_Static_assert(sizeof(snsv10_r02_t) == 4, "Punned Structure Size");

// Register 0x03
typedef union snsv10_r03{
  struct{
    unsigned TSNS_SEL_CONV_TIME		: 4;
    unsigned TSNS_SEL_REF_STB_TIME		: 2;
    unsigned TSNS_SEL_STB_TIME		: 3;
    unsigned TSNS_SEL_VVDD		: 4;
    unsigned TSNS_MOM		: 3;
    unsigned TSNS_MIM		: 3;
  };
  uint32_t as_int;
} snsv10_r03_t;
#define SNSv10_R03_DEFAULT {{0x6, 0x2, 0x3, 0xE, 0x4, 0x4}}
_Static_assert(sizeof(snsv10_r03_t) == 4, "Punned Structure Size");

// Register 0x04
typedef union snsv10_r04{
  struct{
    unsigned TSNS_PDIFF		: 15;
  };
  uint32_t as_int;
} snsv10_r04_t;
#define SNSv10_R04_DEFAULT {{0x0200}}
_Static_assert(sizeof(snsv10_r04_t) == 4, "Punned Structure Size");

// Register 0x05
typedef union snsv10_r05{
  struct{
    unsigned TSNS_POLY		: 24;
  };
  uint32_t as_int;
} snsv10_r05_t;
#define SNSv10_R05_DEFAULT {{0x004000}}
_Static_assert(sizeof(snsv10_r05_t) == 4, "Punned Structure Size");

// Register 0x06
// -- READ-ONLY --

// Register 0x07
typedef union snsv10_r07{
  struct{
    unsigned TSNS_INT_RPLY_REG_ADDR		: 8;
    unsigned TSNS_INT_RPLY_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} snsv10_r07_t;
#define SNSv10_R07_DEFAULT {{0x00, 0x10}}
_Static_assert(sizeof(snsv10_r07_t) == 4, "Punned Structure Size");

// Register 0x08
typedef union snsv10_r08{
  struct{
    unsigned CDC_IRQ_EN		: 1;
    unsigned CDC_MODE_PAR		: 1;
    unsigned CDC_MODE_REF		: 1;
    unsigned CDC_CTRL_DIV		: 2;
    unsigned CDC_CTRL_RING		: 2;
    unsigned CDC_ENABLE		: 1;
    unsigned CDC_RESETn		: 1;
    unsigned CDC_ISOLATE		: 1;
    unsigned CDC_PG_VBAT		: 1;
    unsigned CDC_PG_V1P2		: 1;
    unsigned CDC_PG_VLDO		: 1;
  };
  uint32_t as_int;
} snsv10_r08_t;
#define SNSv10_R08_DEFAULT {{0x1, 0x1, 0x1, 0x1, 0x1, 0x0, 0x0, 0x1, 0x1, 0x1, 0x1}}
_Static_assert(sizeof(snsv10_r08_t) == 4, "Punned Structure Size");

// Register 0x09
typedef union snsv10_r09{
  struct{
    unsigned CDC_N_CYCLE_SINGLE		: 10;
    unsigned CDC_N_INIT_CLK		: 10;
  };
  uint32_t as_int;
} snsv10_r09_t;
#define SNSv10_R09_DEFAULT {{0x008, 0x080}}
_Static_assert(sizeof(snsv10_r09_t) == 4, "Punned Structure Size");

// Register 0x0A
typedef union snsv10_r0A{
  struct{
    unsigned CDC_T_CHARGE		: 10;
    unsigned CDC_N_CYCLE_SET		: 10;
  };
  uint32_t as_int;
} snsv10_r0A_t;
#define SNSv10_R0A_DEFAULT {{0x080, 0x010}}
_Static_assert(sizeof(snsv10_r0A_t) == 4, "Punned Structure Size");

// Register 0x0B
// -- READ-ONLY --

// Register 0x0C
// -- READ-ONLY --

// Register 0x0D
// -- READ-ONLY --

// Register 0x0E
// -- READ-ONLY --

// Register 0x0F
// -- READ-ONLY --

// Register 0x10
// -- READ-ONLY --

// Register 0x11
// -- READ-ONLY --

// Register 0x12
// -- READ-ONLY --

// Register 0x13
// -- READ-ONLY --

// Register 0x14
// -- READ-ONLY --

// Register 0x15
// -- READ-ONLY --

// Register 0x16
typedef union snsv10_r16{
  struct{
    unsigned CDC_INT_RPLY_REG_ADDR		: 8;
    unsigned CDC_INT_RPLY_SHORT_ADDR		: 8;
    unsigned CDC_INT_RPLY_LENGTH_1		: 8;
  };
  uint32_t as_int;
} snsv10_r16_t;
#define SNSv10_R16_DEFAULT {{0x01, 0x10, 0x00}}
_Static_assert(sizeof(snsv10_r16_t) == 4, "Punned Structure Size");

// Register 0x17
typedef union snsv10_r17{
  struct{
    unsigned WUP_INT_RPLY_REG_ADDR		: 8;
    unsigned WUP_INT_RPLY_SHORT_ADDR		: 8;
    unsigned NOT_DEFINED_23_16		: 1;
    unsigned NOT_DEFINED_23_17		: 1;
    unsigned NOT_DEFINED_23_18		: 1;
    unsigned NOT_DEFINED_23_19		: 1;
    unsigned NOT_DEFINED_23_20		: 1;
    unsigned WUP_AUTO_RESET		: 1;
    unsigned WUP_LC_IRQ_EN		: 1;
    unsigned WUP_ENABLE		: 1;
  };
  uint32_t as_int;
} snsv10_r17_t;
#define SNSv10_R17_DEFAULT {{0x07, 0x10, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1, 0x1, 0x0}}
_Static_assert(sizeof(snsv10_r17_t) == 4, "Punned Structure Size");

// Register 0x18
typedef union snsv10_r18{
  struct{
    unsigned WUP_INT_RPLY_PAYLOAD		: 24;
  };
  uint32_t as_int;
} snsv10_r18_t;
#define SNSv10_R18_DEFAULT {{0x00E00A}}
_Static_assert(sizeof(snsv10_r18_t) == 4, "Punned Structure Size");

// Register 0x19
typedef union snsv10_r19{
  struct{
    unsigned WUP_THRESHOLD		: 24;
  };
  uint32_t as_int;
} snsv10_r19_t;
#define SNSv10_R19_DEFAULT {{0x00EA60}}
_Static_assert(sizeof(snsv10_r19_t) == 4, "Punned Structure Size");

// Register 0x1A
// -- READ-ONLY --

// Register 0x1B
typedef union snsv10_r1B{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
  };
  uint32_t as_int;
} snsv10_r1B_t;
#define SNSv10_R1B_DEFAULT {{0x1, 0x2}}
_Static_assert(sizeof(snsv10_r1B_t) == 4, "Punned Structure Size");

#endif // SNSV10_RF_H