//************************************************************
// Desciption: VIMv1 Register File Header File
//      Generated by genRF 07/21/2017 14:39:19
//************************************************************

#ifndef VIMV1_RF_H
#define VIMV1_RF_H

// Register 0x00
typedef union vimv1_r00{
  struct{
    unsigned C_PIX_CLAMPVOLTAGE		: 8;
  };
  uint32_t as_int;
} vimv1_r00_t;
#define VIMv1_R00_DEFAULT {{0x00}}
_Static_assert(sizeof(vimv1_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union vimv1_r01{
  struct{
    unsigned R_PIX_LOAD		: 4;
  };
  uint32_t as_int;
} vimv1_r01_t;
#define VIMv1_R01_DEFAULT {{0x4}}
_Static_assert(sizeof(vimv1_r01_t) == 4, "Punned Structure Size");

// Register 0x02
typedef union vimv1_r02{
  struct{
    unsigned C_HSCAN_BITEN		: 12;
  };
  uint32_t as_int;
} vimv1_r02_t;
#define VIMv1_R02_DEFAULT {{0x000}}
_Static_assert(sizeof(vimv1_r02_t) == 4, "Punned Structure Size");

// Register 0x03
typedef union vimv1_r03{
  struct{
    unsigned C_COMP_AVGMIDCODE		: 4;
  };
  uint32_t as_int;
} vimv1_r03_t;
#define VIMv1_R03_DEFAULT {{0x8}}
_Static_assert(sizeof(vimv1_r03_t) == 4, "Punned Structure Size");

// Register 0x04
typedef union vimv1_r04{
  struct{
    unsigned R_COMP_PREAMPSTR		: 3;
  };
  uint32_t as_int;
} vimv1_r04_t;
#define VIMv1_R04_DEFAULT {{0x2}}
_Static_assert(sizeof(vimv1_r04_t) == 4, "Punned Structure Size");

// Register 0x05
typedef union vimv1_r05{
  struct{
    unsigned C_DAC_AGCAP		: 2;
  };
  uint32_t as_int;
} vimv1_r05_t;
#define VIMv1_R05_DEFAULT {{0x0}}
_Static_assert(sizeof(vimv1_r05_t) == 4, "Punned Structure Size");

// Register 0x06
typedef union vimv1_r06{
  struct{
    unsigned C_CDAC_PDCNBIAS		: 7;
  };
  uint32_t as_int;
} vimv1_r06_t;
#define VIMv1_R06_DEFAULT {{0x40}}
_Static_assert(sizeof(vimv1_r06_t) == 4, "Punned Structure Size");

// Register 0x07
typedef union vimv1_r07{
  struct{
    unsigned C_CDAC_PDFNBIAS		: 7;
  };
  uint32_t as_int;
} vimv1_r07_t;
#define VIMv1_R07_DEFAULT {{0x40}}
_Static_assert(sizeof(vimv1_r07_t) == 4, "Punned Structure Size");

// Register 0x08
typedef union vimv1_r08{
  struct{
    unsigned C_CDAC_PUPBIAS		: 7;
  };
  uint32_t as_int;
} vimv1_r08_t;
#define VIMv1_R08_DEFAULT {{0x40}}
_Static_assert(sizeof(vimv1_r08_t) == 4, "Punned Structure Size");

// Register 0x09
typedef union vimv1_r09{
  struct{
    unsigned R_PIX_RESETDIR		: 1;
  };
  uint32_t as_int;
} vimv1_r09_t;
#define VIMv1_R09_DEFAULT {{0x0}}
_Static_assert(sizeof(vimv1_r09_t) == 4, "Punned Structure Size");

// Register 0x0A
// -- EMPTY --

// Register 0x0B
// -- EMPTY --

// Register 0x0C
// -- EMPTY --

// Register 0x0D
// -- EMPTY --

// Register 0x0E
// -- EMPTY --

// Register 0x0F
// -- EMPTY --

// Register 0x10
// -- EMPTY --

// Register 0x11
// -- EMPTY --

// Register 0x12
// -- EMPTY --

// Register 0x13
// -- EMPTY --

// Register 0x14
// -- EMPTY --

// Register 0x15
// -- EMPTY --

// Register 0x16
// -- EMPTY --

// Register 0x17
// -- EMPTY --

// Register 0x18
// -- EMPTY --

// Register 0x19
// -- EMPTY --

// Register 0x1A
typedef union vimv1_r1A{
  struct{
    unsigned CTRL_POWER_CTRL		: 4;
  };
  uint32_t as_int;
} vimv1_r1A_t;
#define VIMv1_R1A_DEFAULT {{0xF}}
_Static_assert(sizeof(vimv1_r1A_t) == 4, "Punned Structure Size");

// Register 0x1B
typedef union vimv1_r1B{
  struct{
    unsigned IRQ_SHORT_ADDR		: 8;
  };
  uint32_t as_int;
} vimv1_r1B_t;
#define VIMv1_R1B_DEFAULT {{0x10}}
_Static_assert(sizeof(vimv1_r1B_t) == 4, "Punned Structure Size");

// Register 0x1C
typedef union vimv1_r1C{
  struct{
    unsigned IRQ_REG_ADDR		: 8;
  };
  uint32_t as_int;
} vimv1_r1C_t;
#define VIMv1_R1C_DEFAULT {{0x07}}
_Static_assert(sizeof(vimv1_r1C_t) == 4, "Punned Structure Size");

// Register 0x1D
typedef union vimv1_r1D{
  struct{
    unsigned IRQ_PAYLOAD		: 12;
  };
  uint32_t as_int;
} vimv1_r1D_t;
#define VIMv1_R1D_DEFAULT {{0x000}}
_Static_assert(sizeof(vimv1_r1D_t) == 4, "Punned Structure Size");

// Register 0x1E
// -- EMPTY --

// Register 0x1F
// -- EMPTY --

// Register 0x20
typedef union vimv1_r20{
  struct{
    unsigned ENABLE_LC_MEM		: 1;
  };
  uint32_t as_int;
} vimv1_r20_t;
#define VIMv1_R20_DEFAULT {{0x0}}
_Static_assert(sizeof(vimv1_r20_t) == 4, "Punned Structure Size");

// Register 0x21
// -- READ-ONLY --

// Register 0x22
typedef union vimv1_r22{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
  };
  uint32_t as_int;
} vimv1_r22_t;
#define VIMv1_R22_DEFAULT {{0x1, 0x2}}
_Static_assert(sizeof(vimv1_r22_t) == 4, "Punned Structure Size");

// Register 0x23
// -- EMPTY --

// Register 0x24
// -- EMPTY --

// Register 0x25
// -- EMPTY --

// Register 0x26
// -- EMPTY --

// Register 0x27
// -- EMPTY --

// Register 0x28
// -- EMPTY --

// Register 0x29
// -- EMPTY --

// Register 0x2A
// -- EMPTY --

// Register 0x2B
// -- EMPTY --

// Register 0x2C
// -- EMPTY --

// Register 0x2D
// -- EMPTY --

// Register 0x2E
// -- EMPTY --

// Register 0x2F
// -- EMPTY --

// Register 0x30
// -- EMPTY --

// Register 0x31
// -- EMPTY --

// Register 0x32
// -- EMPTY --

// Register 0x33
// -- EMPTY --

// Register 0x34
// -- EMPTY --

// Register 0x35
// -- EMPTY --

// Register 0x36
// -- EMPTY --

// Register 0x37
// -- EMPTY --

// Register 0x38
// -- EMPTY --

// Register 0x39
// -- EMPTY --

// Register 0x3A
// -- EMPTY --

// Register 0x3B
// -- EMPTY --

// Register 0x3C
// -- EMPTY --

// Register 0x3D
typedef union vimv1_r3D{
  struct{
    unsigned STR_WR_CH0_WR_BUF_LOWER		: 16;
    unsigned STR_WR_CH0_ALT_ADDR		: 8;
  };
  uint32_t as_int;
} vimv1_r3D_t;
#define VIMv1_R3D_DEFAULT {{0x0000, 0x00}}
_Static_assert(sizeof(vimv1_r3D_t) == 4, "Punned Structure Size");

// Register 0x3E
typedef union vimv1_r3E{
  struct{
    unsigned STR_WR_CH0_WR_BUF_UPPER		: 16;
    unsigned STR_WR_CH0_ALT_REG_WR		: 8;
  };
  uint32_t as_int;
} vimv1_r3E_t;
#define VIMv1_R3E_DEFAULT {{0x0000, 0x00}}
_Static_assert(sizeof(vimv1_r3E_t) == 4, "Punned Structure Size");

// Register 0x3F
typedef union vimv1_r3F{
  struct{
    unsigned STR_WR_CH0_BUF_LEN		: 20;
    unsigned NOT_DEFINED_63_20		: 1;
    unsigned STR_WR_CH0_DBLB		: 1;
    unsigned STR_WR_CH0_WRP		: 1;
    unsigned STR_WR_CH0_EN		: 1;
  };
  uint32_t as_int;
} vimv1_r3F_t;
#define VIMv1_R3F_DEFAULT {{0x001FF, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(vimv1_r3F_t) == 4, "Punned Structure Size");

// Register 0x40
typedef union vimv1_r40{
  struct{
    unsigned STR_WR_CH0_BUF_OFF		: 20;
  };
  uint32_t as_int;
} vimv1_r40_t;
#define VIMv1_R40_DEFAULT {{0x00000}}
_Static_assert(sizeof(vimv1_r40_t) == 4, "Punned Structure Size");

// Register 0x41
// -- EMPTY --

// Register 0x42
// -- EMPTY --

// Register 0x43
typedef union vimv1_r43{
  struct{
    unsigned BLK_WR_LENGTH_LIMIT		: 20;
    unsigned NOT_DEFINED_67_20		: 1;
    unsigned NOT_DEFINED_67_21		: 1;
    unsigned BLK_WR_CACT		: 1;
    unsigned BLK_WR_EN		: 1;
  };
  uint32_t as_int;
} vimv1_r43_t;
#define VIMv1_R43_DEFAULT {{0x00000, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(vimv1_r43_t) == 4, "Punned Structure Size");

// Register 0x44
// -- EMPTY --

// Register 0x45
// -- EMPTY --

// Register 0x46
// -- EMPTY --

// Register 0x47
// -- EMPTY --

// Register 0x48
// -- EMPTY --

// Register 0x49
// -- EMPTY --

// Register 0x4A
// -- EMPTY --

// Register 0x4B
// -- EMPTY --

// Register 0x4C
// -- EMPTY --

// Register 0x4D
// -- EMPTY --

// Register 0x4E
// -- EMPTY --

// Register 0x4F
// -- EMPTY --

// Register 0x50
typedef union vimv1_r50{
  struct{
    unsigned NOT_DEFINED_80_0		: 1;
    unsigned NOT_DEFINED_80_1		: 1;
    unsigned NOT_DEFINED_80_2		: 1;
    unsigned NOT_DEFINED_80_3		: 1;
    unsigned NOT_DEFINED_80_4		: 1;
    unsigned NOT_DEFINED_80_5		: 1;
    unsigned NOT_DEFINED_80_6		: 1;
    unsigned NOT_DEFINED_80_7		: 1;
    unsigned NOT_DEFINED_80_8		: 1;
    unsigned NOT_DEFINED_80_9		: 1;
    unsigned NOT_DEFINED_80_10		: 1;
    unsigned NOT_DEFINED_80_11		: 1;
    unsigned NOT_DEFINED_80_12		: 1;
    unsigned NOT_DEFINED_80_13		: 1;
    unsigned NOT_DEFINED_80_14		: 1;
    unsigned NOT_DEFINED_80_15		: 1;
    unsigned NOT_DEFINED_80_16		: 1;
    unsigned NOT_DEFINED_80_17		: 1;
    unsigned NOT_DEFINED_80_18		: 1;
    unsigned NOT_DEFINED_80_19		: 1;
    unsigned NOT_DEFINED_80_20		: 1;
    unsigned NOT_DEFINED_80_21		: 1;
    unsigned NOT_DEFINED_80_22		: 1;
    unsigned ACT_RST		: 1;
  };
  uint32_t as_int;
} vimv1_r50_t;
#define VIMv1_R50_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
_Static_assert(sizeof(vimv1_r50_t) == 4, "Punned Structure Size");

#endif // VIMV1_RF_H