//************************************************************
// Desciption: MEMv3 Register File Header File
//      Generated by genRF (Version 1.30) 04/29/2019 12:55:16
//************************************************************

//*******************************************************************************************
// This file has been modified as below
//  - Prefix memv3 is replaced by mem
//  - Prefix MEMv3 is replaced by MEM
//-------------------------------------------------------------------------------------------
//  Jun 23 2021 -   First commit 
//  Yejoong Kim (yejoong@cubeworks.io)
//*******************************************************************************************

#ifndef MEMV3_RF_H
#define MEMV3_RF_H

// Register 0x00
typedef union mem_r00{
  struct{
    unsigned SRAM0_USE_INVERTER_SA		: 1;
    unsigned SRAM0_TUNE_DECODER_DLY		: 5;
    unsigned SRAM0_TUNE_WL_WIDTH		: 3;
    unsigned SRAM0_TUNE_ASO_DLY		: 5;
  };
  uint32_t as_int;
} mem_r00_t;
#define MEM_R00_DEFAULT {{0x0, 0x10, 0x2, 0x00}}
_Static_assert(sizeof(mem_r00_t) == 4, "Punned Structure Size");

// Register 0x01
typedef union mem_r01{
  struct{
    unsigned SRAM1_USE_INVERTER_SA		: 1;
    unsigned SRAM1_TUNE_DECODER_DLY		: 5;
    unsigned SRAM1_TUNE_WL_WIDTH		: 3;
    unsigned SRAM1_TUNE_ASO_DLY		: 5;
  };
  uint32_t as_int;
} mem_r01_t;
#define MEM_R01_DEFAULT {{0x0, 0x10, 0x2, 0x00}}
_Static_assert(sizeof(mem_r01_t) == 4, "Punned Structure Size");

// Register 0x02
// -- EMPTY --

// Register 0x03
// -- EMPTY --

// Register 0x04
// -- EMPTY --

// Register 0x05
// -- EMPTY --

// Register 0x06
// -- EMPTY --

// Register 0x07
// -- EMPTY --

// Register 0x08
// -- EMPTY --

// Register 0x09
// -- EMPTY --

// Register 0x0A
// -- EMPTY --

// Register 0x0B
// -- EMPTY --

// Register 0x0C
// -- EMPTY --

// Register 0x0D
// -- EMPTY --

// Register 0x0E
// -- EMPTY --

// Register 0x0F
typedef union mem_r0F{
  struct{
    unsigned LC_CLK_RING		: 2;
    unsigned LC_CLK_DIV		: 2;
  };
  uint32_t as_int;
} mem_r0F_t;
#define MEM_R0F_DEFAULT {{0x2, 0x2}}
_Static_assert(sizeof(mem_r0F_t) == 4, "Punned Structure Size");

// Register 0x10
// -- EMPTY --

// Register 0x11
// -- EMPTY --

// Register 0x12
// -- EMPTY --

// Register 0x13
// -- EMPTY --

// Register 0x14
// -- EMPTY --

// Register 0x15
// -- EMPTY --

// Register 0x16
// -- EMPTY --

// Register 0x17
// -- EMPTY --

// Register 0x18
// -- EMPTY --

// Register 0x19
typedef union mem_r19{
  struct{
    unsigned NOT_DEFINED_25_0		: 1;
    unsigned NOT_DEFINED_25_1		: 1;
    unsigned NOT_DEFINED_25_2		: 1;
    unsigned NOT_DEFINED_25_3		: 1;
    unsigned NOT_DEFINED_25_4		: 1;
    unsigned NOT_DEFINED_25_5		: 1;
    unsigned NOT_DEFINED_25_6		: 1;
    unsigned NOT_DEFINED_25_7		: 1;
    unsigned NOT_DEFINED_25_8		: 1;
    unsigned NOT_DEFINED_25_9		: 1;
    unsigned NOT_DEFINED_25_10		: 1;
    unsigned NOT_DEFINED_25_11		: 1;
    unsigned NOT_DEFINED_25_12		: 1;
    unsigned NOT_DEFINED_25_13		: 1;
    unsigned NOT_DEFINED_25_14		: 1;
    unsigned NOT_DEFINED_25_15		: 1;
    unsigned STR_WR_CH1_ALT_ADDR		: 8;
  };
  uint32_t as_int;
} mem_r19_t;
#define MEM_R19_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0xF0}}
_Static_assert(sizeof(mem_r19_t) == 4, "Punned Structure Size");

// Register 0x1A
typedef union mem_r1A{
  struct{
    unsigned NOT_DEFINED_26_0		: 1;
    unsigned NOT_DEFINED_26_1		: 1;
    unsigned NOT_DEFINED_26_2		: 1;
    unsigned NOT_DEFINED_26_3		: 1;
    unsigned NOT_DEFINED_26_4		: 1;
    unsigned NOT_DEFINED_26_5		: 1;
    unsigned NOT_DEFINED_26_6		: 1;
    unsigned NOT_DEFINED_26_7		: 1;
    unsigned NOT_DEFINED_26_8		: 1;
    unsigned NOT_DEFINED_26_9		: 1;
    unsigned NOT_DEFINED_26_10		: 1;
    unsigned NOT_DEFINED_26_11		: 1;
    unsigned NOT_DEFINED_26_12		: 1;
    unsigned NOT_DEFINED_26_13		: 1;
    unsigned NOT_DEFINED_26_14		: 1;
    unsigned NOT_DEFINED_26_15		: 1;
    unsigned STR_WR_CH1_ALT_REG_WR		: 8;
  };
  uint32_t as_int;
} mem_r1A_t;
#define MEM_R1A_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x00}}
_Static_assert(sizeof(mem_r1A_t) == 4, "Punned Structure Size");

// Register 0x1B
typedef union mem_r1B{
  struct{
    unsigned STR_WR_CH1_BUF_LEN		: 12;
    unsigned NOT_DEFINED_27_12		: 1;
    unsigned NOT_DEFINED_27_13		: 1;
    unsigned NOT_DEFINED_27_14		: 1;
    unsigned NOT_DEFINED_27_15		: 1;
    unsigned NOT_DEFINED_27_16		: 1;
    unsigned NOT_DEFINED_27_17		: 1;
    unsigned NOT_DEFINED_27_18		: 1;
    unsigned NOT_DEFINED_27_19		: 1;
    unsigned NOT_DEFINED_27_20		: 1;
    unsigned STR_WR_CH1_DBLB		: 1;
    unsigned STR_WR_CH1_WRP		: 1;
    unsigned STR_WR_CH1_EN		: 1;
  };
  uint32_t as_int;
} mem_r1B_t;
#define MEM_R1B_DEFAULT {{0xFFF, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(mem_r1B_t) == 4, "Punned Structure Size");

// Register 0x1C
typedef union mem_r1C{
  struct{
    unsigned STR_WR_CH1_BUF_OFF		: 12;
  };
  uint32_t as_int;
} mem_r1C_t;
#define MEM_R1C_DEFAULT {{0x000}}
_Static_assert(sizeof(mem_r1C_t) == 4, "Punned Structure Size");

// Register 0x1D
typedef union mem_r1D{
  struct{
    unsigned NOT_DEFINED_29_0		: 1;
    unsigned NOT_DEFINED_29_1		: 1;
    unsigned NOT_DEFINED_29_2		: 1;
    unsigned NOT_DEFINED_29_3		: 1;
    unsigned NOT_DEFINED_29_4		: 1;
    unsigned NOT_DEFINED_29_5		: 1;
    unsigned NOT_DEFINED_29_6		: 1;
    unsigned NOT_DEFINED_29_7		: 1;
    unsigned NOT_DEFINED_29_8		: 1;
    unsigned NOT_DEFINED_29_9		: 1;
    unsigned NOT_DEFINED_29_10		: 1;
    unsigned NOT_DEFINED_29_11		: 1;
    unsigned NOT_DEFINED_29_12		: 1;
    unsigned NOT_DEFINED_29_13		: 1;
    unsigned NOT_DEFINED_29_14		: 1;
    unsigned NOT_DEFINED_29_15		: 1;
    unsigned STR_WR_CH0_ALT_ADDR		: 8;
  };
  uint32_t as_int;
} mem_r1D_t;
#define MEM_R1D_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0xF0}}
_Static_assert(sizeof(mem_r1D_t) == 4, "Punned Structure Size");

// Register 0x1E
typedef union mem_r1E{
  struct{
    unsigned NOT_DEFINED_30_0		: 1;
    unsigned NOT_DEFINED_30_1		: 1;
    unsigned NOT_DEFINED_30_2		: 1;
    unsigned NOT_DEFINED_30_3		: 1;
    unsigned NOT_DEFINED_30_4		: 1;
    unsigned NOT_DEFINED_30_5		: 1;
    unsigned NOT_DEFINED_30_6		: 1;
    unsigned NOT_DEFINED_30_7		: 1;
    unsigned NOT_DEFINED_30_8		: 1;
    unsigned NOT_DEFINED_30_9		: 1;
    unsigned NOT_DEFINED_30_10		: 1;
    unsigned NOT_DEFINED_30_11		: 1;
    unsigned NOT_DEFINED_30_12		: 1;
    unsigned NOT_DEFINED_30_13		: 1;
    unsigned NOT_DEFINED_30_14		: 1;
    unsigned NOT_DEFINED_30_15		: 1;
    unsigned STR_WR_CH0_ALT_REG_WR		: 8;
  };
  uint32_t as_int;
} mem_r1E_t;
#define MEM_R1E_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x00}}
_Static_assert(sizeof(mem_r1E_t) == 4, "Punned Structure Size");

// Register 0x1F
typedef union mem_r1F{
  struct{
    unsigned STR_WR_CH0_BUF_LEN		: 12;
    unsigned NOT_DEFINED_31_12		: 1;
    unsigned NOT_DEFINED_31_13		: 1;
    unsigned NOT_DEFINED_31_14		: 1;
    unsigned NOT_DEFINED_31_15		: 1;
    unsigned NOT_DEFINED_31_16		: 1;
    unsigned NOT_DEFINED_31_17		: 1;
    unsigned NOT_DEFINED_31_18		: 1;
    unsigned NOT_DEFINED_31_19		: 1;
    unsigned NOT_DEFINED_31_20		: 1;
    unsigned STR_WR_CH0_DBLB		: 1;
    unsigned STR_WR_CH0_WRP		: 1;
    unsigned STR_WR_CH0_EN		: 1;
  };
  uint32_t as_int;
} mem_r1F_t;
#define MEM_R1F_DEFAULT {{0xFFF, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(mem_r1F_t) == 4, "Punned Structure Size");

// Register 0x20
typedef union mem_r20{
  struct{
    unsigned STR_WR_CH0_BUF_OFF		: 12;
  };
  uint32_t as_int;
} mem_r20_t;
#define MEM_R20_DEFAULT {{0x000}}
_Static_assert(sizeof(mem_r20_t) == 4, "Punned Structure Size");

// Register 0x21
// -- EMPTY --

// Register 0x22
// -- EMPTY --

// Register 0x23
typedef union mem_r23{
  struct{
    unsigned NOT_DEFINED_35_0		: 1;
    unsigned NOT_DEFINED_35_1		: 1;
    unsigned NOT_DEFINED_35_2		: 1;
    unsigned NOT_DEFINED_35_3		: 1;
    unsigned NOT_DEFINED_35_4		: 1;
    unsigned NOT_DEFINED_35_5		: 1;
    unsigned NOT_DEFINED_35_6		: 1;
    unsigned NOT_DEFINED_35_7		: 1;
    unsigned NOT_DEFINED_35_8		: 1;
    unsigned NOT_DEFINED_35_9		: 1;
    unsigned NOT_DEFINED_35_10		: 1;
    unsigned NOT_DEFINED_35_11		: 1;
    unsigned NOT_DEFINED_35_12		: 1;
    unsigned NOT_DEFINED_35_13		: 1;
    unsigned NOT_DEFINED_35_14		: 1;
    unsigned NOT_DEFINED_35_15		: 1;
    unsigned NOT_DEFINED_35_16		: 1;
    unsigned NOT_DEFINED_35_17		: 1;
    unsigned NOT_DEFINED_35_18		: 1;
    unsigned NOT_DEFINED_35_19		: 1;
    unsigned NOT_DEFINED_35_20		: 1;
    unsigned NOT_DEFINED_35_21		: 1;
    unsigned NOT_DEFINED_35_22		: 1;
    unsigned BLK_WR_EN		: 1;
  };
  uint32_t as_int;
} mem_r23_t;
#define MEM_R23_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x1}}
_Static_assert(sizeof(mem_r23_t) == 4, "Punned Structure Size");

// Register 0x24
// -- EMPTY --

// Register 0x25
// -- EMPTY --

// Register 0x26
// -- EMPTY --

// Register 0x27
// -- EMPTY --

// Register 0x28
// -- EMPTY --

// Register 0x29
// -- EMPTY --

// Register 0x2A
// -- EMPTY --

// Register 0x2B
// -- EMPTY --

// Register 0x2C
// -- EMPTY --

// Register 0x2D
// -- EMPTY --

// Register 0x2E
// -- EMPTY --

// Register 0x2F
// -- EMPTY --

// Register 0x30
typedef union mem_r30{
  struct{
    unsigned NOT_DEFINED_48_0		: 1;
    unsigned NOT_DEFINED_48_1		: 1;
    unsigned NOT_DEFINED_48_2		: 1;
    unsigned NOT_DEFINED_48_3		: 1;
    unsigned NOT_DEFINED_48_4		: 1;
    unsigned NOT_DEFINED_48_5		: 1;
    unsigned NOT_DEFINED_48_6		: 1;
    unsigned NOT_DEFINED_48_7		: 1;
    unsigned NOT_DEFINED_48_8		: 1;
    unsigned NOT_DEFINED_48_9		: 1;
    unsigned NOT_DEFINED_48_10		: 1;
    unsigned NOT_DEFINED_48_11		: 1;
    unsigned NOT_DEFINED_48_12		: 1;
    unsigned NOT_DEFINED_48_13		: 1;
    unsigned NOT_DEFINED_48_14		: 1;
    unsigned NOT_DEFINED_48_15		: 1;
    unsigned NOT_DEFINED_48_16		: 1;
    unsigned NOT_DEFINED_48_17		: 1;
    unsigned NOT_DEFINED_48_18		: 1;
    unsigned NOT_DEFINED_48_19		: 1;
    unsigned NOT_DEFINED_48_20		: 1;
    unsigned NOT_DEFINED_48_21		: 1;
    unsigned NOT_DEFINED_48_22		: 1;
    unsigned ACT_RST		: 1;
  };
  uint32_t as_int;
} mem_r30_t;
#define MEM_R30_DEFAULT {{0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0}}
_Static_assert(sizeof(mem_r30_t) == 4, "Punned Structure Size");

#endif // MEMV3_RF_H
